00001  FD  ASCOEPRW
00002      LABEL RECORDS ARE STANDARD
00003      BLOCK CONTAINS 0 RECORDS
00004      RECORD CONTAINS 610 CHARACTERS
00005      DATA RECORD ASCOEPRWREC.
00006  01  ASCOEPRWREC.
00007  COPY ASCOEPRWR1.
