00001  FD  ASCOEWRK
00002      BLOCK  CONTAINS 0 CHARACTERS
00003      RECORD CONTAINS 80  TO 26580 CHARACTERS
00004      LABEL  RECORDS  ARE STANDARD
00005      RECORDING MODE  IS  S
00006      DATA RECORD IS ASCOEWRKREC.
00007  01  ASCOEWRKREC.
00008  COPY ASCOEWRKR1.
