00001  FD  NPHE-FILE
00002      BLOCK CONTAINS 0 RECORDS
00003      RECORDING MODE IS F
00004      RECORD CONTAINS 80 CHARACTERS
00005      LABEL RECORDS ARE STANDARD
00006      DATA RECORD IS NPHE-REC.
00007  01  NPHE-REC.
00008  COPY ASNPHERD01.
