00010  FD  DISEXMPT-FILE
00020      BLOCK CONTAINS 0 RECORDS
00030      RECORD CONTAINS 75 CHARACTERS
00040      LABEL RECORDS ARE STANDARD.
00051  01  DISEXMPT-REC.
00060  COPY ASREASDVR1.
