00001  FD  MASTER-OUT-2
00002      BLOCK  CONTAINS 0 CHARACTERS
00003      RECORD CONTAINS 122 TO 18706 CHARACTERS
00004      LABEL  RECORDS  ARE STANDARD
00005      RECORDING MODE  IS  S
00006      DATA RECORD IS MSTR-OUT-REC-2.
00007  01  MSTR-OUT-REC-2.
00008  COPY ASREASRD09.
