00001  IDENTIFICATION DIVISION.
00002  PROGRAM-ID. ASREA001.
00003  AUTHOR. JENDRAS.
00004  DATE-WRITTEN. 04-29-93.
00005 *REMARKS. THIS PROGRAM IS USED FOR TESTING COBOL LOGIC.
00006  ENVIRONMENT DIVISION.
00007  CONFIGURATION SECTION.
00008  SOURCE-COMPUTER. IBM-370.
00009  OBJECT-COMPUTER. IBM-370.
00010  INPUT-OUTPUT SECTION.
00011  FILE-CONTROL.
00012  DATA DIVISION.
00013  FILE SECTION.
00014  WORKING-STORAGE SECTION.
00015  77  SAVE-TRAN-CD      PIC 999 VALUE 011.
00016      88  SAVE-SPEC-RFND-11 VALUE 11.
00017  77  AR-TXYR           PIC 99    VALUE 90.
00018  77  TESTFLD           PIC X     VALUE 'X'.
00019  77  FLD1              PIC X     VALUE '1'.
00020  77  FLD2              PIC X     VALUE '1'.
00021  77  FLD3              PIC X     VALUE '1'.
00022  77  FLD4              PIC X     VALUE '2'.
00023  PROCEDURE DIVISION.
00024      DISPLAY 'ASREA001 STARTED'.
00025      IF FLD1 NOT = FLD2
00026        OR FLD3 NOT = FLD4
00027        DISPLAY 'PROBLEM EXISTS'.
00028      IF SAVE-SPEC-RFND-11 AND AR-TXYR > 84
00029        DISPLAY 'PROBLEM DOES NOT EXIST'.
00030      STOP RUN.
