00001  IDENTIFICATION DIVISION.
00002  PROGRAM-ID. ASREA018.
00003  AUTHOR. RUGIS - MOLIS.
00004  DATE-WRITTEN.  SEPTEMBER 18, 1987.
00005 *REMARKS. THIS PROGRAM RECOMPUTES THE OVERALL CLASS
00006 *         IN THE ASSESSMENT MASTER FILE.
00007 *MOD ON 07/95 - ADD NEW MAJOR CLASS 7 CODE MINOR CODES TO PROGRAM
00008 *               LOGIC.
00009 *MOD ON 05/00 - ADD NEW MAJOR CLASS 218 219 220 AND 221 TO PROGRAM
00010 *               LOGIC.
00011      SKIP3
00012  ENVIRONMENT DIVISION.
00013  CONFIGURATION SECTION.
00014  SOURCE-COMPUTER. IBM-370.
00015  OBJECT-COMPUTER. IBM-370.
00016      SKIP1
00017  INPUT-OUTPUT SECTION.
00018  FILE-CONTROL.
00019      SELECT MASTER-IN   ASSIGN TO UT-S-MASTIN.
00020      SELECT MASTER-OUT  ASSIGN TO UT-S-MASTOUT.
00021      SELECT PRINT-FILE  ASSIGN TO UT-S-PRINTFL.
00022      SKIP3
00023  DATA DIVISION.
00024  FILE SECTION.
00025      SKIP1
00026  COPY ASREASFD01.
00027      SKIP2
00028  COPY ASREASFD02.
00029      SKIP2
00030  COPY PRINTFILE.
00031      SKIP3
00032  WORKING-STORAGE SECTION.
00033      SKIP1
00034  77  MAST-IN-CNT     PACKED-DECIMAL PIC S9(7) VALUE +0.
00035  77  MAST-OUT-CNT    PACKED-DECIMAL PIC S9(7) VALUE +0.
00036  77  MAST-CHNG-CNT   PACKED-DECIMAL PIC S9(7) VALUE +0.
00037  77  LINE-CNT        PACKED-DECIMAL PIC S9(3) VALUE +60.
00038  77  PAGE-CNT        PACKED-DECIMAL PIC S9(5) VALUE +0.
00039  77  OA-SUB          COMP    PIC S9(4)   VALUE +0.
00040  77  SV-CLASS                PIC 9(3)    VALUE ZEROES.
00041      SKIP1
00042  77  EOF-SW                  PIC X       VALUE 'N'.
00043      88  EOF                             VALUE 'Y'.
00044      SKIP1
00045  77  ERR-SW                  PIC X       VALUE 'N'.
00046      88  ERR                             VALUE 'Y'.
00047      SKIP1
00048  77  PRINT-RPT-SW            PIC X       VALUE 'N'.
00049      88  PRINT-RPT                       VALUE 'Y'.
00050      SKIP1
00051  77  NO-COMPUTE-SW           PIC X       VALUE 'N'.
00052      88  NO-COMPUTE                      VALUE 'Y'.
00053      SKIP2
00054  01  WORK-AREA.
00055      SKIP1
00056      05  DSP-DATE.
00057          10  DSP-MO                 PIC 99.
00058          10  FILLER                 PIC X         VALUE '/'.
00059          10  DSP-DA                 PIC 99.
00060          10  FILLER                 PIC X         VALUE '/'.
00061          10  DSP-YR                 PIC 99.
00062      05  ACPT-DATE                  PIC 9(6).
00063      05  ACPT-DATE-X REDEFINES ACPT-DATE.
00064          10  ACPT-YR                PIC 99.
00065          10  ACPT-MO                PIC 99.
00066          10  ACPT-DA                PIC 99.
00067      SKIP2
00068      05  CURR-KEY.
00069          10  CURR-TOWN    PIC 99.
00070          10  CURR-VOL     PIC 9(3).
00071          10  CURR-PROP    PIC 9(15).
00072          10  CURR-TXTYP   PIC X.
00073      SKIP1
00074      05  PREV-KEY         PIC X(21)   VALUE LOW-VALUES.
00075      SKIP2
00076      05  UNPK-TXCD        PIC 9(5).
00077      05  FILLER REDEFINES UNPK-TXCD.
00078          10  UNPK-TOWN    PIC 99.
00079          10  FILLER       PIC 9(3).
00080      SKIP2
00081      05  HEADING1.
00082          10  FILLER       PIC X(3)    VALUE SPACES.
00083          10  HD1-DATE     PIC X(8).
00084          10  FILLER       PIC X(40)   VALUE SPACES.
00085          10  FILLER       PIC X(70)   VALUE
00086              'OFFICE OF THE COOK COUNTY ASSESSOR'.
00087          10  FILLER       PIC X(5)    VALUE 'PAGE'.
00088          10  HD1-PAGE     PIC Z,ZZ9.
00089      SKIP2
00090      05  HEADING2.
00091          10  FILLER       PIC X(3)    VALUE SPACES.
00092          10  FILLER       PIC X(49)   VALUE 'ASREA018'.
00093          10  FILLER       PIC X(32)   VALUE
00094              'RECOMPUTED OVER-ALL CLASS REPORT'.
00095      SKIP2
00096      05  HEADING3.
00097          10  FILLER       PIC X(31)   VALUE SPACES.
00098          10  FILLER       PIC X(16)   VALUE 'VOLUME'.
00099          10  FILLER       PIC X(16)   VALUE 'PROPERTY'.
00100          10  FILLER       PIC X(12)   VALUE 'TAX'.
00101          10  FILLER       PIC X(12)   VALUE 'OLD'.
00102          10  FILLER       PIC X(3)    VALUE 'NEW'.
00103      SKIP2
00104      05  HEADING4.
00105          10  FILLER       PIC X(48)   VALUE SPACES.
00106          10  FILLER       PIC X(15)   VALUE 'NUMBER'.
00107          10  FILLER       PIC X(12)   VALUE 'TYPE'.
00108          10  FILLER       PIC X(12)   VALUE 'CLASS'.
00109          10  FILLER       PIC X(5)    VALUE 'CLASS'.
00110      SKIP2
00111      05  DETAIL-LINE             VALUE SPACES.
00112          10  FILLER           PIC X(33).
00113          10  DL-VOL           PIC 9(3).
00114          10  FILLER           PIC X(5).
00115          10  DL-PROP          PIC Z99,99,999,999,9999.
00116          10  FILLER           PIC X(5).
00117          10  DL-TXTYP         PIC 9.
00118          10  FILLER           PIC X(9).
00119          10  DL-OCLS          PIC 9,99.
00120          10  FILLER           PIC X(8).
00121          10  DL-NCLS          PIC 9,99.
00122          10  FILLER           PIC XX.
00123          10  DL-MSG           PIC X(32).
00124      SKIP2
00125      05  TOTAL-LINE             VALUE SPACES.
00126          10  FILLER           PIC X(3).
00127          10  TL-MSG           PIC X(23).
00128          10  TL-TOT           PIC Z,ZZZ,ZZ9.
00129      SKIP2
00130      05 OA-SWITCHES.
00131         10 OA-SW959      PIC X   VALUE 'N'.
00132            88 OA-SW959-YES       VALUE 'Y'.
00133         10 OA-SW991      PIC X   VALUE 'N'.
00134            88 OA-SW991-YES       VALUE 'Y'.
00135         10 OA-SW889      PIC X   VALUE 'N'.
00136            88 OA-SW889-YES       VALUE 'Y'.
00137         10 OA-SW893      PIC X   VALUE 'N'.
00138            88 OA-SW893-YES       VALUE 'Y'.
00139         10 OA-SW883      PIC X   VALUE 'N'.
00140            88 OA-SW883-YES       VALUE 'Y'.
00141         10 OA-SW833      PIC X   VALUE 'N'.
00142            88 OA-SW833-YES       VALUE 'Y'.
00143         10 OA-SW899      PIC X   VALUE 'N'.
00144            88 OA-SW899-YES       VALUE 'Y'.
00145         10 OA-SW835      PIC X   VALUE 'N'.
00146            88 OA-SW835-YES       VALUE 'Y'.
00147         10 OA-SW891      PIC X   VALUE 'N'.
00148            88 OA-SW891-YES       VALUE 'Y'.
00149         10 OA-SW892      PIC X   VALUE 'N'.
00150            88 OA-SW892-YES       VALUE 'Y'.
00151         10 OA-SW799      PIC X   VALUE 'N'.
00152            88 OA-SW799-YES       VALUE 'Y'.
00153         10 OA-SW735      PIC X   VALUE 'N'.
00154            88 OA-SW735-YES       VALUE 'Y'.
00155         10 OA-SW745      PIC X   VALUE 'N'.
00156            88 OA-SW745-YES       VALUE 'Y'.
00157         10 OA-SW791      PIC X   VALUE 'N'.
00158            88 OA-SW791-YES       VALUE 'Y'.
00159         10 OA-SW774      PIC X   VALUE 'N'.
00160            88 OA-SW774-YES       VALUE 'Y'.
00161         10 OA-SW792      PIC X   VALUE 'N'.
00162            88 OA-SW792-YES       VALUE 'Y'.
00163         10 OA-SW772      PIC X   VALUE 'N'.
00164            88 OA-SW772-YES       VALUE 'Y'.
00165         10 OA-SW679      PIC X   VALUE 'N'.
00166            88 OA-SW679-YES       VALUE 'Y'.
00167         10 OA-SW669      PIC X   VALUE 'N'.
00168            88 OA-SW669-YES       VALUE 'Y'.
00169         10 OA-SW663      PIC X   VALUE 'N'.
00170            88 OA-SW663-YES       VALUE 'Y'.
00171         10 OA-SW638      PIC X   VALUE 'N'.
00172            88 OA-SW638-YES       VALUE 'Y'.
00173         10 OA-SW673      PIC X   VALUE 'N'.
00174            88 OA-SW673-YES       VALUE 'Y'.
00175         10 OA-SW666      PIC X   VALUE 'N'.
00176            88 OA-SW666-YES       VALUE 'Y'.
00177         10 OA-SW689      PIC X   VALUE 'N'.
00178            88 OA-SW689-YES       VALUE 'Y'.
00179         10 OA-SW693      PIC X   VALUE 'N'.
00180            88 OA-SW693-YES       VALUE 'Y'.
00181         10 OA-SW683      PIC X   VALUE 'N'.
00182            88 OA-SW683-YES       VALUE 'Y'.
00183         10 OA-SW589      PIC X   VALUE 'N'.
00184            88 OA-SW589-YES       VALUE 'Y'.
00185         10 OA-SW593      PIC X   VALUE 'N'.
00186            88 OA-SW593-YES       VALUE 'Y'.
00187         10 OA-SW583      PIC X   VALUE 'N'.
00188            88 OA-SW583-YES       VALUE 'Y'.
00189         10 OA-SW599      PIC X   VALUE 'N'.
00190            88 OA-SW599-YES       VALUE 'Y'.
00191         10 OA-SW535      PIC X   VALUE 'N'.
00192            88 OA-SW535-YES       VALUE 'Y'.
00193         10 OA-SW591      PIC X   VALUE 'N'.
00194            88 OA-SW591-YES       VALUE 'Y'.
00195         10 OA-SW592      PIC X   VALUE 'N'.
00196            88 OA-SW592-YES       VALUE 'Y'.
00197         10 OA-SW489      PIC X   VALUE 'N'.
00198            88 OA-SW489-YES       VALUE 'Y'.
00199         10 OA-SW493      PIC X   VALUE 'N'.
00200            88 OA-SW493-YES       VALUE 'Y'.
00201         10 OA-SW483      PIC X   VALUE 'N'.
00202            88 OA-SW483-YES       VALUE 'Y'.
00203         10 OA-SW499      PIC X   VALUE 'N'.
00204            88 OA-SW499-YES       VALUE 'Y'.
00205         10 OA-SW435      PIC X   VALUE 'N'.
00206            88 OA-SW435-YES       VALUE 'Y'.
00207         10 OA-SW491      PIC X   VALUE 'N'.
00208            88 OA-SW491-YES       VALUE 'Y'.
00209         10 OA-SW492      PIC X   VALUE 'N'.
00210            88 OA-SW492-YES       VALUE 'Y'.
00211         10 OA-SW399      PIC X   VALUE 'N'.
00212            88 OA-SW399-YES       VALUE 'Y'.
00213         10 OA-SW391      PIC X   VALUE 'N'.
00214            88 OA-SW391-YES       VALUE 'Y'.
00215         10 OA-SW299      PIC X   VALUE 'N'.
00216            88 OA-SW299-YES       VALUE 'Y'.
00217         10 OA-SW-TYPE1   PIC X   VALUE 'N'.
00218            88 OA-SW-TYPE1-NO     VALUE 'N'.
00219            88 OA-SW-TYPE1-YES    VALUE 'Y'.
00220         10 OA-SW-TYPE2-5 PIC X   VALUE 'N'.
00221            88 OA-SW-TYPE2-5-NO   VALUE 'N'.
00222            88 OA-SW-TYPE2-5-YES  VALUE 'Y'.
00223         10 OA-SW-MAJ9-OTHR1        PIC X   VALUE 'N'.
00224            88 OA-SW-MAJ9-OTHR1-YES         VALUE 'Y'.
00225         10 OA-SW-MAJ9-OTHR2        PIC X   VALUE 'N'.
00226            88 OA-SW-MAJ9-OTHR2-YES         VALUE 'Y'.
00227         10 OA-SW-MAJ8-OTHR1        PIC X   VALUE 'N'.
00228            88 OA-SW-MAJ8-OTHR1-YES         VALUE 'Y'.
00229         10 OA-SW-MAJ8-OTHR2        PIC X   VALUE 'N'.
00230            88 OA-SW-MAJ8-OTHR2-YES         VALUE 'Y'.
00231         10 OA-SW-MAJ8-OTHR3        PIC X   VALUE 'N'.
00232            88 OA-SW-MAJ8-OTHR3-YES         VALUE 'Y'.
00233         10 OA-SW-MAJ7-OTHR1        PIC X   VALUE 'N'.
00234            88 OA-SW-MAJ7-OTHR1-YES         VALUE 'Y'.
00235         10 OA-SW-MAJ7-OTHR2        PIC X   VALUE 'N'.
00236            88 OA-SW-MAJ7-OTHR2-YES         VALUE 'Y'.
00237         10 OA-SW-MAJ7-OTHR3        PIC X   VALUE 'N'.
00238            88 OA-SW-MAJ7-OTHR3-YES         VALUE 'Y'.
00239         10 OA-SW-MAJ6-OTHR1        PIC X   VALUE 'N'.
00240            88 OA-SW-MAJ6-OTHR1-YES         VALUE 'Y'.
00241         10 OA-SW-MAJ6-OTHR2        PIC X   VALUE 'N'.
00242            88 OA-SW-MAJ6-OTHR2-YES         VALUE 'Y'.
00243         10 OA-SW-MAJ6-OTHR3        PIC X   VALUE 'N'.
00244            88 OA-SW-MAJ6-OTHR3-YES         VALUE 'Y'.
00245         10 OA-SW-MAJ5-OTHR1        PIC X   VALUE 'N'.
00246            88 OA-SW-MAJ5-OTHR1-YES         VALUE 'Y'.
00247         10 OA-SW-MAJ5-OTHR2        PIC X   VALUE 'N'.
00248            88 OA-SW-MAJ5-OTHR2-YES         VALUE 'Y'.
00249         10 OA-SW-MAJ5-OTHR3        PIC X   VALUE 'N'.
00250            88 OA-SW-MAJ5-OTHR3-YES         VALUE 'Y'.
00251         10 OA-SW-MAJ4-OTHR1        PIC X   VALUE 'N'.
00252            88 OA-SW-MAJ4-OTHR1-YES         VALUE 'Y'.
00253         10 OA-SW-MAJ4-OTHR2        PIC X   VALUE 'N'.
00254            88 OA-SW-MAJ4-OTHR2-YES         VALUE 'Y'.
00255         10 OA-SW-MAJ4-OTHR3        PIC X   VALUE 'N'.
00256            88 OA-SW-MAJ4-OTHR3-YES         VALUE 'Y'.
00257         10 OA-SW-MAJ3-OTHR1        PIC X   VALUE 'N'.
00258            88 OA-SW-MAJ3-OTHR1-YES         VALUE 'Y'.
00259         10 OA-SW-MAJ3-OTHR2        PIC X   VALUE 'N'.
00260            88 OA-SW-MAJ3-OTHR2-YES         VALUE 'Y'.
00261         10 OA-SW-MAJ2-OTHR1        PIC X   VALUE 'N'.
00262            88 OA-SW-MAJ2-OTHR1-YES         VALUE 'Y'.
00263         10 OA-SW-MAJ2-OTHR2        PIC X   VALUE 'N'.
00264            88 OA-SW-MAJ2-OTHR2-YES         VALUE 'Y'.
00265         10 OA-SW-MAJ1-OTHR         PIC X   VALUE 'N'.
00266            88 OA-SW-MAJ1-OTHR-YES          VALUE 'Y'.
00267
00268      03  OA-HOLD-AREA                      VALUE ZEROS.
00269          10  OVERALL-CLASS  PIC 999.
00270              88  OA-CLS959         VALUE 959.
00271              88  OA-CLS991         VALUE 991.
00272              88  OA-CLS889         VALUE 889.
00273              88  OA-CLS893         VALUE 893.
00274              88  OA-CLS883         VALUE 883.
00275              88  OA-CLS833         VALUE 833.
00276              88  OA-CLS899         VALUE 899.
00277              88  OA-CLS835         VALUE 835.
00278              88  OA-CLS891         VALUE 891.
00279              88  OA-CLS892         VALUE 892.
00280              88  OA-CLS799         VALUE 799.
00281              88  OA-CLS735         VALUE 735.
00282              88  OA-CLS745         VALUE 745.
00283              88  OA-CLS791         VALUE 791.
00284              88  OA-CLS774         VALUE 774.
00285              88  OA-CLS792         VALUE 792.
00286              88  OA-CLS772         VALUE 772.
00287              88  OA-CLS679         VALUE 679.
00288              88  OA-CLS669         VALUE 669.
00289              88  OA-CLS663         VALUE 663.
00290              88  OA-CLS638         VALUE 638.
00291              88  OA-CLS673         VALUE 673.
00292              88  OA-CLS666         VALUE 666.
00293              88  OA-CLS689         VALUE 689.
00294              88  OA-CLS693         VALUE 693.
00295              88  OA-CLS683         VALUE 683.
00296              88  OA-CLS589         VALUE 589.
00297              88  OA-CLS593         VALUE 593.
00298              88  OA-CLS583         VALUE 583.
00299              88  OA-CLS599         VALUE 599.
00300              88  OA-CLS535         VALUE 535.
00301              88  OA-CLS591         VALUE 591.
00302              88  OA-CLS592         VALUE 592.
00303              88  OA-CLS489         VALUE 489.
00304              88  OA-CLS493         VALUE 493.
00305              88  OA-CLS483         VALUE 483.
00306              88  OA-CLS499         VALUE 499.
00307              88  OA-CLS435         VALUE 435.
00308              88  OA-CLS491         VALUE 491.
00309              88  OA-CLS492         VALUE 492.
00310              88  OA-CLS399         VALUE 399.
00311              88  OA-CLS391         VALUE 391.
00312              88  OA-CLS299         VALUE 299.
00313              88  OA-MAJ9-OTHR-CHK1 VALUE 913 914 915 918 919 920
00314                                          921 996.
00315              88  OA-MAJ9-OTHR-CHK2 VALUE 901 990 997.
00316              88  OA-MAJ8-OTHR-CHK1 VALUE 832 831 830 829 828
00317                                          827 826 823 817 816.
00318              88  OA-MAJ8-OTHR-CHK2 VALUE 887 881 880.
00319              88  OA-MAJ8-OTHR-CHK3 VALUE 897 890 801.
00320              88  OA-MAJ7-OTHR-CHK1 VALUE 733 732 731 730 716 717
00321                                          729 728 727 726 723 722
00322                                          746 747 748 752 753 756
00323                                          757 758 760 761 762 764
00324                                          767.
00325              88  OA-MAJ7-OTHR-CHK2 VALUE 765 743.
00326              88  OA-MAJ7-OTHR-CHK3 VALUE 701 797 790.
00327              88  OA-MAJ6-OTHR-CHK1 VALUE 670 671 677.
00328              88  OA-MAJ6-OTHR-CHK2 VALUE 680 681 687.
00329              88  OA-MAJ6-OTHR-CHK3 VALUE 654 655 668.
00330              88  OA-MAJ5-OTHR-CHK1 VALUE 516 517 522 523 526 527
00331                                          528 529 530 531 532 533.
00332              88  OA-MAJ5-OTHR-CHK2 VALUE 580 581 587.
00333              88  OA-MAJ5-OTHR-CHK3 VALUE 501 590 597.
00334              88  OA-MAJ4-OTHR-CHK1 VALUE 413 THRU 423
00335                                          426 THRU 433
00336                                          496.
00337              88  OA-MAJ4-OTHR-CHK2 VALUE 480 481 487.
00338              88  OA-MAJ4-OTHR-CHK3 VALUE 401 490 497.
00339              88  OA-MAJ3-OTHR-CHK1 VALUE 313 314 315 318 319 320
00340                                          321 396 397.
00341              88  OA-MAJ3-OTHR-CHK2 VALUE 301 390.
00342              88  OA-MAJ2-OTHR-CHK1 VALUE 202 THRU 213
00343                                          224 225 234 278 294 295
00344                                          297 218 219 220 221.
00345              88  OA-MAJ2-OTHR-CHK2 VALUE 201 290 236 288.
00346              88  OA-MAJ1-OTHR-CHK  VALUE 101 THRU 199.
00347
00348         10  FILLER  REDEFINES OVERALL-CLASS.
00349             15  OA-MAJOR     PIC 9.
00350             15  OA-MINOR     PIC 99.
00351                 88  OA-MI-88       VALUE  88.
00352
00353          10  OA-HI-LAND              PIC S9(3).
00354          10  OA-HI-OTHER             PIC S9(3).
00355          10  OA-HI-OTHER-VAL         PIC S9(9).
00356          10  OA-COMPARE-IMPRV        PIC S9(13).
00357          10  OA-COMPARE-OTHER        PIC S9(13).
00358
00359          10  OA-HLDMAJ-VAL-MIN       PIC S9(13).
00360          10  FILLER REDEFINES OA-HLDMAJ-VAL-MIN.
00361              15  OA-HLDMAJR PIC 9.
00362              15  OA-HLD321  PIC 9.
00363              15  OA-HLDVAL  PIC S9(9).
00364              15  OA-HLDMINR PIC 99.
00365      SKIP1
00366 *     THE ABOVE FIELDS ARE USED FOR -
00367 *         O V E R A L L   C L A S S   C O M P U T A T I O N
00368 *         -------------   ---------   ---------------------
00369 *****************************************************************
00370  EJECT
00371  PROCEDURE DIVISION.
00372      SKIP3
00373    010-HOUSEKEEPING.
00374      OPEN INPUT MASTER-IN
00375          OUTPUT MASTER-OUT  PRINT-FILE.
00376      SKIP1
00377      ACCEPT ACPT-DATE FROM DATE.
00378      MOVE ACPT-MO TO DSP-MO.
00379      MOVE ACPT-DA TO DSP-DA.
00380      MOVE ACPT-YR TO DSP-YR.
00381      MOVE DSP-DATE TO HD1-DATE.
00382      SKIP3
00383      PERFORM 020-MAINLINE UNTIL EOF.
00384      SKIP3
00385      DISPLAY 'TOTAL MASTER RECORDS READ    ' MAST-IN-CNT.
00386      DISPLAY 'TOTAL MASTER RECORDS UPDATED ' MAST-CHNG-CNT.
00387      DISPLAY 'TOTAL MASTER RECORDS WRITTEN ' MAST-OUT-CNT.
00388      SKIP1
00389      CLOSE MASTER-IN
00390            MASTER-OUT  PRINT-FILE.
00391      STOP RUN.
00392  SKIP3
00393  020-MAINLINE.
00394      PERFORM 030-READ-MASTER.
00395      IF NOT EOF
00396         MOVE MSTR-IN-REC TO MSTR-OUT-REC
00397         MOVE M-CLS OF MSTR-IN-REC TO SV-CLASS
00398         PERFORM 040-COMPUTE-OVERALL-CLASS
00399         IF SV-CLASS NOT EQUAL M-CLS OF MSTR-OUT-REC
00400             PERFORM 100-PRINT-DETAIL-LINE
00401             PERFORM 110-WRITE-MASTER
00402         ELSE
00403             PERFORM 110-WRITE-MASTER
00404             IF PRINT-RPT
00405                 MOVE 'N' TO PRINT-RPT-SW
00406                 PERFORM 100-PRINT-DETAIL-LINE.
00407      SKIP3
00408  030-READ-MASTER.
00409      READ MASTER-IN
00410         AT END
00411          MOVE 'Y' TO EOF-SW.
00412      IF NOT EOF
00413         ADD +1 TO MAST-IN-CNT
00414         MOVE M-TXCD OF MSTR-IN-REC TO UNPK-TXCD
00415         MOVE UNPK-TOWN TO CURR-TOWN
00416         MOVE M-VOL  OF MSTR-IN-REC TO CURR-VOL
00417         MOVE M-PROP OF MSTR-IN-REC TO CURR-PROP
00418         MOVE M-TXTYP OF MSTR-IN-REC TO CURR-TXTYP
00419         IF CURR-KEY LESS PREV-KEY
00420            DISPLAY 'ASSESSMENT MASTER FILE OUT OF SEQUENCE'
00421            DISPLAY 'CURRENT KEY  = ' CURR-KEY
00422            DISPLAY 'PREVIOUS KEY = ' PREV-KEY
00423            MOVE 'Y' TO ERR-SW
00424            MOVE +16 TO RETURN-CODE
00425         ELSE
00426            MOVE CURR-KEY TO PREV-KEY.
00427  SKIP3
00428  040-COMPUTE-OVERALL-CLASS.
00429      MOVE  ALL 'N' TO OA-SWITCHES.
00430      MOVE -1 TO OA-HI-LAND  OA-HI-OTHER  OA-HI-OTHER-VAL
00431                 OA-COMPARE-IMPRV  OA-COMPARE-OTHER
00432                 OA-HLDMAJ-VAL-MIN.
00433      PERFORM  050-EACH-DETAIL
00434                VARYING OA-SUB FROM +1 BY +1
00435                UNTIL OA-SUB GREATER THAN M-DTL-QST-CTR-1.
00436
00437      IF  OA-SW-TYPE1-NO
00438           MOVE  'NO LAND RECORD PRESENT' TO DL-MSG
00439           PERFORM  100-PRINT-DETAIL-LINE.
00440
00441      IF OA-SW-TYPE1-YES AND OA-SW-TYPE2-5-NO
00442         MOVE  OA-HI-LAND TO M-CLS OF MSTR-OUT-REC
00443      ELSE
00444      IF OA-SW-TYPE2-5-YES
00445       IF OA-SW959-YES
00446          MOVE  959 TO M-CLS OF MSTR-OUT-REC
00447       ELSE
00448       IF OA-SW991-YES
00449          MOVE  991 TO M-CLS OF MSTR-OUT-REC
00450       ELSE
00451       IF OA-SW-MAJ9-OTHR1-YES
00452          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00453       ELSE
00454       IF OA-SW-MAJ9-OTHR2-YES
00455          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00456       ELSE
00457       IF OA-SW889-YES
00458          MOVE  889 TO M-CLS OF MSTR-OUT-REC
00459       ELSE
00460       IF OA-SW893-YES
00461          MOVE  893 TO M-CLS OF MSTR-OUT-REC
00462       ELSE
00463       IF OA-SW883-YES
00464          MOVE  883 TO M-CLS OF MSTR-OUT-REC
00465       ELSE
00466       IF OA-SW899-YES
00467          MOVE  899 TO M-CLS OF MSTR-OUT-REC
00468       ELSE
00469       IF OA-SW835-YES
00470          MOVE  835 TO M-CLS OF MSTR-OUT-REC
00471       ELSE
00472       IF OA-SW833-YES
00473          MOVE  833 TO M-CLS OF MSTR-OUT-REC
00474       ELSE
00475       IF OA-SW891-YES
00476          MOVE  891 TO M-CLS OF MSTR-OUT-REC
00477       ELSE
00478       IF OA-SW892-YES
00479          MOVE  892 TO M-CLS OF MSTR-OUT-REC
00480       ELSE
00481       IF OA-SW-MAJ8-OTHR1-YES
00482          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00483       ELSE
00484       IF OA-SW-MAJ8-OTHR2-YES
00485          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00486       ELSE
00487       IF OA-SW-MAJ8-OTHR3-YES
00488          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00489       ELSE
00490       IF OA-SW799-YES
00491          MOVE  799 TO M-CLS OF MSTR-OUT-REC
00492       ELSE
00493       IF OA-SW735-YES
00494          MOVE  735 TO M-CLS OF MSTR-OUT-REC
00495       ELSE
00496       IF OA-SW745-YES
00497          MOVE  745 TO M-CLS OF MSTR-OUT-REC
00498       ELSE
00499       IF OA-SW791-YES
00500          MOVE  791 TO M-CLS OF MSTR-OUT-REC
00501       ELSE
00502       IF OA-SW792-YES
00503          MOVE  792 TO M-CLS OF MSTR-OUT-REC
00504       ELSE
00505       IF OA-SW774-YES
00506          MOVE  774 TO M-CLS OF MSTR-OUT-REC
00507       ELSE
00508       IF OA-SW792-YES
00509          MOVE  792 TO M-CLS OF MSTR-OUT-REC
00510       ELSE
00511       IF OA-SW772-YES
00512          MOVE  772 TO M-CLS OF MSTR-OUT-REC
00513       ELSE
00514       IF OA-SW-MAJ7-OTHR1-YES
00515          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00516       ELSE
00517       IF OA-SW-MAJ7-OTHR2-YES
00518          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00519       ELSE
00520       IF OA-SW-MAJ7-OTHR3-YES
00521          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00522       ELSE
00523       IF OA-SW679-YES
00524          MOVE  679 TO M-CLS OF MSTR-OUT-REC
00525       ELSE
00526       IF OA-SW663-YES
00527          MOVE  663 TO M-CLS OF MSTR-OUT-REC
00528       ELSE
00529       IF OA-SW638-YES
00530          MOVE  638 TO M-CLS OF MSTR-OUT-REC
00531       ELSE
00532       IF OA-SW666-YES
00533          MOVE  666 TO M-CLS OF MSTR-OUT-REC
00534       ELSE
00535       IF OA-SW673-YES
00536          MOVE  673 TO M-CLS OF MSTR-OUT-REC
00537       ELSE
00538       IF OA-SW689-YES
00539          MOVE  689 TO M-CLS OF MSTR-OUT-REC
00540       ELSE
00541       IF OA-SW693-YES
00542          MOVE  693 TO M-CLS OF MSTR-OUT-REC
00543       ELSE
00544       IF OA-SW683-YES
00545          MOVE  683 TO M-CLS OF MSTR-OUT-REC
00546       ELSE
00547       IF OA-SW-MAJ6-OTHR1-YES
00548          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00549       ELSE
00550       IF OA-SW-MAJ6-OTHR2-YES
00551          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00552       ELSE
00553       IF OA-SW-MAJ6-OTHR3-YES
00554          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00555       ELSE
00556       IF OA-SW589-YES
00557          MOVE  589 TO M-CLS OF MSTR-OUT-REC
00558       ELSE
00559       IF OA-SW593-YES
00560          MOVE  593 TO M-CLS OF MSTR-OUT-REC
00561       ELSE
00562       IF OA-SW583-YES
00563          MOVE  583 TO M-CLS OF MSTR-OUT-REC
00564       ELSE
00565       IF OA-SW599-YES
00566          MOVE  599 TO M-CLS OF MSTR-OUT-REC
00567       ELSE
00568       IF OA-SW535-YES
00569          MOVE  535 TO M-CLS OF MSTR-OUT-REC
00570       ELSE
00571       IF OA-SW591-YES
00572          MOVE  591 TO M-CLS OF MSTR-OUT-REC
00573       ELSE
00574       IF OA-SW592-YES
00575          MOVE  592 TO M-CLS OF MSTR-OUT-REC
00576       ELSE
00577       IF OA-SW-MAJ5-OTHR1-YES
00578          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00579       ELSE
00580       IF OA-SW-MAJ5-OTHR2-YES
00581          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00582       ELSE
00583       IF OA-SW-MAJ5-OTHR3-YES
00584          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00585       ELSE
00586       IF OA-SW489-YES
00587          MOVE  489 TO M-CLS OF MSTR-OUT-REC
00588       ELSE
00589       IF OA-SW493-YES
00590          MOVE  493 TO M-CLS OF MSTR-OUT-REC
00591       ELSE
00592       IF OA-SW483-YES
00593          MOVE  483 TO M-CLS OF MSTR-OUT-REC
00594       ELSE
00595       IF OA-SW499-YES
00596          MOVE  499 TO M-CLS OF MSTR-OUT-REC
00597       ELSE
00598       IF OA-SW435-YES
00599          MOVE  435 TO M-CLS OF MSTR-OUT-REC
00600       ELSE
00601       IF OA-SW491-YES
00602          MOVE  491 TO M-CLS OF MSTR-OUT-REC
00603       ELSE
00604       IF OA-SW492-YES
00605          MOVE  492 TO M-CLS OF MSTR-OUT-REC
00606       ELSE
00607       IF OA-SW-MAJ4-OTHR1-YES
00608          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00609       ELSE
00610       IF OA-SW-MAJ4-OTHR2-YES
00611          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00612       ELSE
00613       IF OA-SW-MAJ4-OTHR3-YES
00614          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00615       ELSE
00616       IF OA-SW399-YES
00617          MOVE  399 TO M-CLS OF MSTR-OUT-REC
00618       ELSE
00619       IF OA-SW391-YES
00620          MOVE  391 TO M-CLS OF MSTR-OUT-REC
00621       ELSE
00622       IF OA-SW-MAJ3-OTHR1-YES
00623          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00624       ELSE
00625       IF OA-SW-MAJ3-OTHR2-YES
00626          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00627       ELSE
00628       IF OA-SW299-YES
00629          MOVE  299 TO M-CLS OF MSTR-OUT-REC
00630       ELSE
00631       IF OA-SW-MAJ2-OTHR1-YES
00632          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00633       ELSE
00634       IF OA-SW-MAJ2-OTHR2-YES
00635          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00636       ELSE
00637       IF OA-SW-MAJ1-OTHR-YES
00638          MOVE  OA-HI-OTHER TO M-CLS OF MSTR-OUT-REC
00639       ELSE
00640          MOVE 'Y' TO PRINT-RPT-SW.
00641
00642  050-EACH-DETAIL.
00643      MOVE  D1-CLS OF MSTR-OUT-REC (OA-SUB) TO OVERALL-CLASS.
00644      IF D1R-TYPE1 (OA-SUB)
00645         MOVE 'Y' TO OA-SW-TYPE1
00646         IF OVERALL-CLASS NUMERIC
00647             IF OVERALL-CLASS GREATER THAN OA-HI-LAND
00648                 MOVE OVERALL-CLASS TO OA-HI-LAND
00649             ELSE
00650                 NEXT SENTENCE
00651         ELSE
00652             NEXT SENTENCE
00653      ELSE
00654          MOVE  'Y' TO OA-SW-TYPE2-5
00655          IF OA-MAJOR EQUAL 9
00656             PERFORM 053-CHECK-MAJ9-CLASSES
00657          ELSE
00658            IF OA-MAJOR EQUAL 8
00659               PERFORM 055-CHECK-MAJ8-CLASSES
00660            ELSE
00661              IF OA-MAJOR EQUAL 7
00662                 PERFORM 060-CHECK-MAJ7-CLASSES
00663              ELSE
00664                IF OA-MAJOR EQUAL 6
00665                   PERFORM 065-CHECK-MAJ6-CLASSES
00666                ELSE
00667                  IF OA-MAJOR EQUAL 5
00668                     PERFORM 070-CHECK-MAJ5-CLASSES
00669                  ELSE
00670                    IF OA-MAJOR EQUAL 4
00671                       PERFORM 075-CHECK-MAJ4-CLASSES
00672                    ELSE
00673                      IF OA-MAJOR EQUAL 3
00674                         PERFORM 080-CHECK-MAJ3-CLASSES
00675                      ELSE
00676                        IF OA-MAJOR EQUAL 2
00677                           PERFORM 085-CHECK-MAJ2-CLASSES
00678                        ELSE
00679                          IF OA-MAJ1-OTHR-CHK
00680                              MOVE 'Y' TO OA-SW-MAJ1-OTHR
00681                              MOVE 3 TO OA-HLD321
00682                              PERFORM 090-CHECK-VALUATION-MINOR
00683                          ELSE
00684                            IF OA-MAJOR EQUAL 1
00685                               MOVE 'Y' TO NO-COMPUTE-SW.
00686
00687      IF D2-CLS OF MSTR-OUT-REC (OA-SUB) NUMERIC
00688          IF D2R-QUES-CLASS (OA-SUB)
00689              ADD 1 TO OA-SUB.
00690
00691  053-CHECK-MAJ9-CLASSES.
00692      IF OA-CLS959
00693         MOVE 'Y' TO OA-SW959
00694         MOVE M-DTL-QST-CTR-1 TO OA-SUB
00695      ELSE
00696        IF OA-CLS991
00697           MOVE  'Y' TO OA-SW991
00698        ELSE
00699          IF OA-MAJ9-OTHR-CHK1
00700             MOVE 'Y' TO OA-SW-MAJ9-OTHR1
00701             MOVE 3 TO OA-HLD321
00702             PERFORM 090-CHECK-VALUATION-MINOR
00703          ELSE
00704            IF OA-MAJ9-OTHR-CHK2
00705               MOVE 'Y' TO OA-SW-MAJ8-OTHR2
00706               MOVE 2 TO OA-HLD321
00707               PERFORM 090-CHECK-VALUATION-MINOR
00708            ELSE
00709              MOVE 'Y' TO NO-COMPUTE-SW.
00710
00711  055-CHECK-MAJ8-CLASSES.
00712      IF OA-CLS889
00713         MOVE 'Y' TO OA-SW889
00714         MOVE M-DTL-QST-CTR-1 TO OA-SUB
00715      ELSE
00716        IF OA-CLS893
00717           MOVE  'Y' TO OA-SW893
00718        ELSE
00719          IF OA-CLS883
00720             MOVE 'Y' TO OA-SW883
00721          ELSE
00722          IF OA-CLS833
00723             MOVE 'Y' TO OA-SW833
00724          ELSE
00725            IF OA-CLS899
00726               MOVE 'Y' TO OA-SW899
00727            ELSE
00728              IF OA-CLS835
00729                 MOVE 'Y' TO OA-SW835
00730              ELSE
00731                IF OA-CLS891
00732                   MOVE 'Y' TO OA-SW891
00733                ELSE
00734                  IF OA-CLS892
00735                     MOVE 'Y' TO OA-SW892
00736                  ELSE
00737                    IF OA-MAJ8-OTHR-CHK1
00738                       MOVE 'Y' TO OA-SW-MAJ8-OTHR1
00739                       MOVE 3 TO OA-HLD321
00740                       PERFORM 090-CHECK-VALUATION-MINOR
00741                    ELSE
00742                      IF OA-MAJ8-OTHR-CHK2
00743                         MOVE 'Y' TO OA-SW-MAJ8-OTHR2
00744                         MOVE 2 TO OA-HLD321
00745                         PERFORM 090-CHECK-VALUATION-MINOR
00746                      ELSE
00747                        IF OA-MAJ8-OTHR-CHK3
00748                           MOVE 'Y' TO OA-SW-MAJ8-OTHR3
00749                           MOVE 1 TO OA-HLD321
00750                           PERFORM 090-CHECK-VALUATION-MINOR
00751                        ELSE
00752                           MOVE 'Y' TO NO-COMPUTE-SW.
00753
00754  060-CHECK-MAJ7-CLASSES.
00755      IF OA-CLS799
00756         MOVE  'Y' TO OA-SW799
00757      ELSE
00758      IF OA-CLS735
00759         MOVE   'Y' TO OA-SW735
00760      ELSE
00761      IF OA-CLS745
00762         MOVE  'Y' TO OA-SW745
00763      ELSE
00764      IF OA-CLS791
00765         MOVE   'Y' TO OA-SW791
00766      ELSE
00767      IF OA-CLS774
00768         MOVE  'Y' TO OA-SW774
00769      ELSE
00770      IF OA-CLS792
00771         MOVE 'Y' TO OA-SW792
00772      ELSE
00773      IF OA-CLS772
00774         MOVE  'Y' TO OA-SW772
00775      ELSE
00776         IF OA-MAJ7-OTHR-CHK1
00777            MOVE 'Y' TO OA-SW-MAJ7-OTHR1
00778            MOVE 3 TO OA-HLD321
00779            PERFORM 090-CHECK-VALUATION-MINOR
00780         ELSE
00781            IF OA-MAJ7-OTHR-CHK2
00782               MOVE 'Y' TO OA-SW-MAJ7-OTHR2
00783               MOVE 2 TO OA-HLD321
00784               PERFORM 090-CHECK-VALUATION-MINOR
00785            ELSE
00786                IF OA-MAJ7-OTHR-CHK3
00787                   MOVE 'Y' TO OA-SW-MAJ7-OTHR3
00788                   MOVE 1 TO OA-HLD321
00789                   PERFORM 090-CHECK-VALUATION-MINOR
00790                ELSE
00791                   MOVE 'Y' TO NO-COMPUTE-SW.
00792
00793  065-CHECK-MAJ6-CLASSES.
00794      IF OA-CLS679
00795         MOVE 'Y' TO OA-SW679
00796      ELSE
00797      IF OA-CLS669
00798         MOVE 'Y' TO OA-SW669
00799      ELSE
00800        IF OA-CLS663
00801           MOVE  'Y' TO OA-SW663
00802        ELSE
00803        IF OA-CLS638
00804           MOVE  'Y' TO OA-SW638
00805        ELSE
00806          IF OA-CLS673
00807             MOVE  'Y' TO OA-SW673
00808          ELSE
00809          IF OA-CLS666
00810             MOVE  'Y' TO OA-SW666
00811          ELSE
00812            IF OA-CLS689
00813               MOVE  'Y' TO OA-SW689
00814            ELSE
00815              IF OA-CLS693
00816                 MOVE 'Y' TO OA-SW693
00817              ELSE
00818                IF OA-CLS683
00819                   MOVE 'Y' TO OA-SW683
00820                ELSE
00821                  IF OA-MAJ6-OTHR-CHK1
00822                     MOVE 'Y' TO OA-SW-MAJ6-OTHR1
00823                     MOVE 3 TO OA-HLD321
00824                     PERFORM 090-CHECK-VALUATION-MINOR
00825                   ELSE
00826                     IF OA-MAJ6-OTHR-CHK2
00827                        MOVE 'Y' TO OA-SW-MAJ6-OTHR2
00828                        MOVE 2 TO OA-HLD321
00829                        PERFORM 090-CHECK-VALUATION-MINOR
00830                     ELSE
00831                         IF OA-MAJ6-OTHR-CHK3
00832                            MOVE 'Y' TO OA-SW-MAJ6-OTHR3
00833                            MOVE 1 TO OA-HLD321
00834                            PERFORM 090-CHECK-VALUATION-MINOR
00835                         ELSE
00836                            MOVE 'Y' TO NO-COMPUTE-SW.
00837
00838  070-CHECK-MAJ5-CLASSES.
00839      IF OA-CLS589
00840         MOVE  'Y' TO OA-SW589
00841      ELSE
00842       IF OA-CLS593
00843          MOVE 'Y' TO OA-SW593
00844       ELSE
00845         IF OA-CLS583
00846            MOVE  'Y' TO OA-SW583
00847         ELSE
00848           IF OA-CLS599
00849              MOVE  'Y' TO OA-SW599
00850            ELSE
00851              IF OA-CLS535
00852                 MOVE  'Y' TO OA-SW535
00853              ELSE
00854                IF OA-CLS591
00855                   MOVE  'Y' TO OA-SW591
00856                ELSE
00857                  IF OA-CLS592
00858                     MOVE  'Y' TO OA-SW592
00859                  ELSE
00860                    IF OA-MAJ5-OTHR-CHK1
00861                        MOVE 'Y' TO OA-SW-MAJ5-OTHR1
00862                        MOVE 3 TO OA-HLD321
00863                        PERFORM 090-CHECK-VALUATION-MINOR
00864                    ELSE
00865                      IF OA-MAJ5-OTHR-CHK2
00866                          MOVE 'Y' TO OA-SW-MAJ5-OTHR2
00867                          MOVE 2 TO OA-HLD321
00868                          PERFORM 090-CHECK-VALUATION-MINOR
00869                      ELSE
00870                        IF OA-MAJ5-OTHR-CHK3
00871                            MOVE 'Y' TO OA-SW-MAJ5-OTHR3
00872                            MOVE 1 TO OA-HLD321
00873                            PERFORM 090-CHECK-VALUATION-MINOR
00874                        ELSE
00875                            MOVE 'Y' TO NO-COMPUTE-SW.
00876
00877  075-CHECK-MAJ4-CLASSES.
00878      IF OA-CLS489
00879         MOVE  'Y' TO OA-SW489
00880      ELSE
00881       IF OA-CLS493
00882          MOVE 'Y' TO OA-SW493
00883       ELSE
00884         IF OA-CLS483
00885            MOVE  'Y' TO OA-SW483
00886         ELSE
00887           IF OA-CLS499
00888              MOVE  'Y' TO OA-SW499
00889            ELSE
00890              IF OA-CLS435
00891                 MOVE  'Y' TO OA-SW435
00892              ELSE
00893                IF OA-CLS491
00894                   MOVE  'Y' TO OA-SW491
00895                ELSE
00896                  IF OA-CLS492
00897                     MOVE  'Y' TO OA-SW492
00898                  ELSE
00899                    IF OA-MAJ4-OTHR-CHK1
00900                       MOVE 'Y' TO OA-SW-MAJ4-OTHR1
00901                       MOVE 3 TO OA-HLD321
00902                       PERFORM 090-CHECK-VALUATION-MINOR
00903                    ELSE
00904                      IF OA-MAJ4-OTHR-CHK2
00905                         MOVE 'Y' TO OA-SW-MAJ4-OTHR2
00906                         MOVE 2 TO OA-HLD321
00907                         PERFORM 090-CHECK-VALUATION-MINOR
00908                      ELSE
00909                        IF OA-MAJ4-OTHR-CHK3
00910                           MOVE 'Y' TO OA-SW-MAJ4-OTHR3
00911                           MOVE 1 TO OA-HLD321
00912                           PERFORM 090-CHECK-VALUATION-MINOR
00913                        ELSE
00914                           MOVE 'Y' TO NO-COMPUTE-SW.
00915
00916  080-CHECK-MAJ3-CLASSES.
00917      IF OA-CLS399
00918         MOVE  'Y' TO OA-SW399
00919      ELSE
00920       IF OA-CLS391
00921          MOVE 'Y' TO OA-SW391
00922       ELSE
00923         IF OA-MAJ3-OTHR-CHK1
00924            MOVE 'Y' TO OA-SW-MAJ3-OTHR1
00925            MOVE 3 TO OA-HLD321
00926            PERFORM 090-CHECK-VALUATION-MINOR
00927         ELSE
00928           IF OA-MAJ3-OTHR-CHK2
00929              MOVE 'Y' TO OA-SW-MAJ3-OTHR2
00930              MOVE 2 TO OA-HLD321
00931              PERFORM 090-CHECK-VALUATION-MINOR
00932           ELSE
00933              MOVE 'Y' TO NO-COMPUTE-SW.
00934
00935  085-CHECK-MAJ2-CLASSES.
00936      IF OA-CLS299
00937         MOVE  'Y' TO OA-SW299
00938      ELSE
00939        IF OA-MAJ2-OTHR-CHK1
00940           MOVE 'Y' TO OA-SW-MAJ2-OTHR1
00941           MOVE 3 TO OA-HLD321
00942           PERFORM 090-CHECK-VALUATION-MINOR
00943        ELSE
00944          IF OA-MAJ2-OTHR-CHK2
00945             MOVE 'Y' TO OA-SW-MAJ2-OTHR2
00946             MOVE 2 TO OA-HLD321
00947             PERFORM 090-CHECK-VALUATION-MINOR
00948          ELSE
00949             MOVE 'Y' TO NO-COMPUTE-SW.
00950
00951  090-CHECK-VALUATION-MINOR.
00952
00953 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
00954 *    FOR ALL SEGMENT TYPES 2-5                                *
00955 *         WHICH HAVE NOT BEEN PREVIOUSLY CHECKED -            *
00956 *          COMPARE ON MAJOR-CLASS, VALUATION, MINOR-CLASS.    *
00957 *                                                             *
00958 *  FOR MINOR-CLASS = '88', FOR COMPARISON ONLY  --            *
00959 *      USE MAJORCLS=0, VALUATION AS IS, AND MINORCLS=00       *
00960 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
00961
00962      IF D2-VAL OF MSTR-OUT-REC (OA-SUB) NUMERIC
00963          MOVE  D2-VAL OF MSTR-OUT-REC (OA-SUB) TO OA-HLDVAL.
00964      IF NOT OA-MI-88
00965          MOVE  OA-MAJOR TO OA-HLDMAJR
00966          MOVE  OA-MINOR TO OA-HLDMINR
00967      ELSE
00968          MOVE  ZERO TO OA-HLDMAJR OA-HLD321 OA-HLDMINR.
00969
00970      IF OA-HLDMAJ-VAL-MIN GREATER OA-COMPARE-OTHER
00971           MOVE  OVERALL-CLASS TO OA-HI-OTHER
00972           MOVE  OA-HLDMAJ-VAL-MIN TO OA-COMPARE-OTHER
00973           IF D2-VAL OF MSTR-OUT-REC (OA-SUB) NUMERIC
00974               MOVE  D2-VAL OF MSTR-OUT-REC (OA-SUB)
00975                               TO OA-HI-OTHER-VAL.
00976      SKIP3
00977  100-PRINT-DETAIL-LINE.
00978      IF LINE-CNT GREATER +56
00979          PERFORM 120-HEADINGS.
00980      MOVE SPACES TO DETAIL-LINE.
00981      MOVE M-VOL OF MSTR-IN-REC  TO DL-VOL.
00982      MOVE M-PROP OF MSTR-IN-REC TO DL-PROP.
00983      MOVE M-TXTYP OF MSTR-IN-REC TO DL-TXTYP.
00984      INSPECT DL-PROP REPLACING ALL ',' BY '-'.
00985      MOVE SV-CLASS              TO DL-OCLS.
00986      INSPECT DL-OCLS REPLACING ALL ',' BY '-'.
00987      IF NO-COMPUTE
00988         MOVE 'N' TO NO-COMPUTE-SW
00989         MOVE 'UNABLE TO COMPUTE OVERALL CLASS' TO DL-MSG
00990         WRITE PRINT-REC FROM DETAIL-LINE AFTER ADVANCING 2
00991      ELSE
00992         MOVE M-CLS OF MSTR-OUT-REC TO DL-NCLS
00993         INSPECT DL-NCLS REPLACING ALL ',' BY '-'
00994         WRITE PRINT-REC FROM DETAIL-LINE AFTER ADVANCING 2.
00995      ADD +2 TO LINE-CNT.
00996      ADD +1 TO MAST-CHNG-CNT.
00997      SKIP3
00998  110-WRITE-MASTER.
00999      WRITE MSTR-OUT-REC.
01000      ADD +1 TO MAST-OUT-CNT.
01001      SKIP3
01002  120-HEADINGS.
01003      ADD +1 TO PAGE-CNT.
01004      MOVE PAGE-CNT TO HD1-PAGE.
01005      WRITE PRINT-REC FROM HEADING1 AFTER ADVANCING PAGE.
01006      WRITE PRINT-REC FROM HEADING2 AFTER ADVANCING 2.
01007      WRITE PRINT-REC FROM HEADING3 AFTER ADVANCING 3.
01008      WRITE PRINT-REC FROM HEADING4 AFTER ADVANCING 1.
01009      MOVE +7 TO LINE-CNT.
