00001  FD  FRZVAL-DIV-FILE
00002      LABEL RECORDS ARE STANDARD
00003      BLOCK CONTAINS 0 RECORDS
00004      RECORD CONTAINS 45 CHARACTERS
00005      DATA RECORD FRZVAL-DIV-REC.
00006  01  FRZVAL-DIV-REC.
00007  COPY CLFRZDIVR1.
