00001  FD  FRZDIV-PRCNT-OUT-FILE
00002      LABEL RECORDS ARE STANDARD
00003      BLOCK CONTAINS 0 RECORDS
00004      RECORD CONTAINS 60 CHARACTERS
00005      DATA RECORD FRZDIV-PRCNT-OUT-REC.
00006  01  FRZDIV-PRCNT-OUT-REC.
00007  COPY CLFZDVPCR2.
