00001  FD  NEWPROP
00002      LABEL RECORDS ARE STANDARD
00003      BLOCK CONTAINS 0 RECORDS
00004      RECORD CONTAINS 100 CHARACTERS
00005      DATA RECORD IS NEWPROP-REC.
00006  01  NEWPROP-REC.
00007  COPY CLNEWPRPR2.
