00001  01  CF-REC.
00002      05 CF-DEL-BYTE    PIC X.
00003 *                                            1      DELETE BYTE
00004      05 CF-PROP-NO     PIC 9(15) COMP-3.
00005 *                                           2-9     PROPERTY
00006 *                                                    NUMBER
00007      05 CF-COOP-QUAN   PIC 9(5)  COMP-3.
00008 *                                           10-12   COOP QUANTITY
