00001  FD  VET-MASTER
00002      LABEL RECORDS ARE STANDARD
00003      BLOCK CONTAINS 0 RECORDS
00004      RECORD CONTAINS 100 CHARACTERS
00005      RECORDING MODE IS F
00006      DATA RECORD IS VET-REC.
00007  01  VET-REC.
00008  COPY VETMST01.
