00001  FD  HOMESTEAD-FILE
00002      LABEL RECORDS ARE STANDARD
00003      RECORDING MODE IS F
00004      RECORD CONTAINS 130 CHARACTERS
00005      BLOCK CONTAINS 0 RECORDS
00006      DATA RECORD IS HOME-REC.
00007  01  HOME-REC.
00008  COPY HOMEXERD01.
