00001  01  IO-PCB.
00002      05  IP-TERM-NAME          PIC X(8).
00003      05  FILLER                PIC XX.
00004      05  IP-STATUS-CODE        PIC XX.
00005          88  IP-GOOD-STATUS                    VALUE SPACES.
00006      05  IP-CURR-DATE-TIME     PIC X(8).
00007      05  IP-MSG-SEQ-NO         PIC X(4).
00008      05  IP-MSG-OUT-DES-NAME   PIC X(4).
00009      05  IP-USER-ID            PIC X(8).
