00001  FD  PRT-ERR-FILE
00002      RECORDING MODE IS  F
00003      RECORD CONTAINS 133 CHARACTERS
00004      BLOCK CONTAINS 0 RECORDS
00005      LABEL RECORDS ARE STANDARD
00006      DATA RECORD IS  PRT-ERR-REC.
00007  01  PRT-ERR-REC        PIC X(133).
