00001  FD  RE-SUM-FILE
00002      LABEL RECORDS ARE STANDARD
00003      BLOCK CONTAINS 0 RECORDS
00004      RECORD CONTAINS 26 CHARACTERS
00005      DATA RECORD IS RE-REC.
00006  01  RE-REC.
00007  COPY RESUMMRD01.
