00001  FD  RR-SUM-FILE
00002      LABEL RECORDS ARE STANDARD
00003      BLOCK CONTAINS 0 RECORDS
00004      RECORD CONTAINS 32 CHARACTERS
00005      DATA RECORD IS RR-SUM-REC.
00006  01  RR-SUM-REC.
00007  COPY RRSUMMRYR2.
