00001  IDENTIFICATION DIVISION.
00002  PROGRAM-ID.    ASREA740.
00003  AUTHOR.        GOLD - MOLIS.
00004  DATE-WRITTEN.  JULY 22, 1992.
00005  SKIP1
00006 *REMARKS. THE PURPOSE OF THIS PROGRAM IS TO CREATE THE FROZEN
00007 *         VALUATION FILE FOR QUAD TOWNSHIPS.
00008  SKIP2
00009  ENVIRONMENT DIVISION.
00010  CONFIGURATION SECTION.
00011  SOURCE-COMPUTER. IBM-370.
00012  OBJECT-COMPUTER. IBM-370.
00013  SKIP1
00014  INPUT-OUTPUT SECTION.
00015  FILE-CONTROL.
00016      SELECT MASTER-IN     ASSIGN TO UT-S-MASTNEW.
00017      SELECT MASTER-IN-BA  ASSIGN TO UT-S-MASTOLD.
00018      SELECT FRZVALFL      ASSIGN TO DA-FRZVALFL
00019             ORGANIZATION IS INDEXED
00020             ACCESS IS RANDOM
00021             RECORD KEY IS FV-KEY
00022             FILE STATUS IS FILE-STATUS.
00023
00024      SELECT PRINT-FILE    ASSIGN TO UT-S-PRINTFLE.
00025      SELECT PRT-ERR-FILE  ASSIGN TO UT-S-PRINTERR.
00026      SELECT PRT-DTL-FILE  ASSIGN TO UT-S-PRINTDTL.
00027      SELECT OUTPUT-FILE   ASSIGN TO UT-S-OUTPUTF.
00028  SKIP1
00029  DATA DIVISION.
00030  FILE SECTION.
00031  SKIP1
00032  COPY ASREASFD06.
00033  SKIP1
00034  FD  MASTER-IN-BA
00035      BLOCK CONTAINS 0 CHARACTERS
00036      RECORD CONTAINS 122 TO 18706 CHARACTERS
00037      LABEL RECORDS ARE STANDARD
00038      RECORDING MODE IS S
00039      DATA RECORD IS MSTR-BA-REC.
00040  01  MSTR-BA-REC.
00041  COPY ASREASRD05.
00042  SKIP1
00043  COPY ASFRZVALF1.
00044  SKIP1
00045  COPY PRINTFILE.
00046  SKIP1
00047  COPY PRINTERRFL.
00048  SKIP1
00049  COPY PRINTDTLFL.
00050  FD  OUTPUT-FILE
00051      BLOCK CONTAINS 0 CHARACTERS
00052      RECORD CONTAINS 130 CHARACTERS
00053      LABEL RECORDS ARE STANDARD
00054      RECORDING MODE IS F
00055      DATA RECORD IS OUTPUT-REC.
00056
00057  01  OUTPUT-REC.
00058      05  OUT-PROP         PIC 9(15).
00059      05  OUT-PROP-IMPV    PIC 9(13).
00060      05  OUT-PROP-CURR-288  PIC 9(13).
00061      05  FILLER           PIC X(89).
00062  EJECT
00063  WORKING-STORAGE SECTION.
00064      SKIP1
00065  77  NEW-EXEMPT-SW      PIC X         VALUE '1'.
00066      88  NEW-EXEMPT                   VALUE '1'.
00067      88  NOT-NEW-EXEMPT               VALUE '0'.
00068  77  OLD-EXEMPT-SW      PIC X         VALUE '1'.
00069      88  OLD-EXEMPT                   VALUE '1'.
00070      88  NOT-OLD-EXEMPT               VALUE '0'.
00071  77  OLD-MAST-RECS      PIC S9(7)     VALUE +0  PACKED-DECIMAL.
00072      88  FIRST-REC-OLD                VALUE +1.
00073  77  NEW-MAST-RECS      PIC S9(7)     VALUE +0  PACKED-DECIMAL.
00074      88  FIRST-REC-NEW                VALUE +1.
00075  77  WS-OUT-CNT         PIC S9(7)     VALUE +0  PACKED-DECIMAL.
00076  77  RECS-UPD           PIC S9(7)     VALUE +0  PACKED-DECIMAL.
00077  77  RECS-ADD           PIC S9(7)     VALUE +0  PACKED-DECIMAL.
00078  77  RECS-WRIT-OLD-1    PIC S9(7)     VALUE +0  PACKED-DECIMAL.
00079  77  RECS-WRIT-OLD-2    PIC S9(7)     VALUE +0  PACKED-DECIMAL.
00080  77  RECS-WRIT-NEW-1    PIC S9(7)     VALUE +0  PACKED-DECIMAL.
00081  77  RECS-WRIT-NEW-2    PIC S9(7)     VALUE +0  PACKED-DECIMAL.
00082  77  RECS-WRIT-3        PIC S9(7)     VALUE +0  PACKED-DECIMAL.
00083  77  WS-P1              PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00084  77  WS-P2              PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00085  77  WS-P3              PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00086  77  WS-P4              PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00087  77  WS-P5              PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00088  77  WS-P6              PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00089  77  WS-P7              PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00090  77  WS-P8              PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00091  77  WS-P9              PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00092  77  WS-P10             PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00093  77  WS-C1              PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00094  77  WS-C2              PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00095  77  WS-C3              PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00096  77  WS-C4              PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00097  77  WS-C5              PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00098  77  WS-C6              PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00099  77  WS-C7              PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00100  77  WS-C8              PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00101  77  WS-C9              PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00102  77  WS-P4P5            PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00103  77  WS-P1P3            PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00104  77  WS-C1C2C3C4        PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00105  77  WS-C4-P3           PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00106  77  WS-P5-P4           PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00107  77  WS-C7-C2-C3        PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00108 *NOTE:  LINE-CNTR IS ACTUALLY NUMBER OF RECORDS PRINTED ON
00109 *       REPORT.  ONLY 2 PER REPORT 1 OR 2 (ONE FOR 3).
00110  77  LINE-CNTR          PIC S9(3)     VALUE +2  PACKED-DECIMAL.
00111  77  PAGE-CNTR          PIC S9(5)     VALUE +0  PACKED-DECIMAL.
00112  77  LINE-CNTR-2        PIC S9(3)     VALUE +2  PACKED-DECIMAL.
00113  77  PAGE-CNTR-2        PIC S9(5)     VALUE +0  PACKED-DECIMAL.
00114  77  PAGE-CNTR-3        PIC S9(5)     VALUE +0  PACKED-DECIMAL.
00115  77  SUB                PIC S9(4)     VALUE +0  BINARY.
00116  77  SUBO               PIC S9(4)     VALUE +0  BINARY.
00117  77  SUBD               PIC S9(4)     VALUE +0  BINARY.
00118  77  SUBV               PIC S9(4)     VALUE +0  BINARY.
00119  77  SUBT               PIC S9(4)     VALUE +0  BINARY.
00120  77  TYPE3-SUM          PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00121  77  TYPE3-SUM2         PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00122  77  TYPE4-SUM          PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00123  77  TYPE4-SUM2         PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00124  77  TYPE5-SUM          PIC S9(13)    VALUE +0  PACKED-DECIMAL.
00125  77  BLANK-LINE         PIC X         VALUE SPACE.
00126      SKIP1
00127  77  NEW-EOF-SW         PIC X         VALUE 'N'.
00128      88  NEW-EOF                      VALUE 'Y'.
00129  77  OLD-EOF-SW         PIC X         VALUE 'N'.
00130      88  OLD-EOF                      VALUE 'Y'.
00131  77  ERR-SW             PIC X         VALUE 'N'.
00132      88  ERR                          VALUE 'Y'.
00133  77  FRZVAL-FILE-FND-SW PIC X         VALUE 'N'.
00134      88  FRZVAL-FILE-FND              VALUE 'F'.
00135  77  PRINT-ERR-MSG-SW   PIC X         VALUE 'N'.
00136      88  PRINT-ERR-MSG                VALUE 'Y'.
00137  77  PRINT-REP-2-SW     PIC X         VALUE 'N'.
00138      88  PRINT-REP-2                  VALUE 'Y'.
00139  77  WS-288-IND-SW      PIC X         VALUE '0'.
00140      88  WS-288-IND-1                 VALUE '1'.
00141  77  WS-CHG-ACT-SW      PIC X         VALUE 'N'.
00142      88  WS-CHG-ACT-Y                 VALUE 'Y'.
00143  77  WS-AGE-CHECK       PIC 999.
00144      88  WS-AGE-1                     VALUE 001.
00145      88  WS-AGE-2-999                 VALUE 002 THRU 999.
00146  77  WS-CLS-CHECK       PIC 999.
00147      88  WS-CLS-288                   VALUE 288.
00148      SKIP1
00149  01  WORK-AREA.
00150      SKIP1
00151      05  FILE-STATUS        PIC 99.
00152          88  VALID-STATUS                 VALUE 00.
00153          88  STREPT-NOTFND                VALUE 23.
00154      05  FILE-STATUS-2      BINARY.
00155          10  FILE-RETURN    PIC 99        VALUE 0.
00156          10  FILE-FUNCTION  PIC 9         VALUE 0.
00157          10  FILE-FEEDBACK  PIC 999       VALUE 0.
00158           SKIP1
00159      05  CURR-NEW-KEY.
00160          10  CNEW-DIV    PIC 9(14)    VALUE ZEROES.
00161          10  CNEW-PROP   PIC 9(15).
00162      05  PREV-NEW-KEY    PIC X(29)    VALUE LOW-VALUES.
00163      SKIP1
00164      05  SAVE-NEW-DIV    PIC 9(14)    VALUE ZEROES.
00165      05  SAVE-NEW-PROP   PIC 9(15)    VALUE ZEROES.
00166      SKIP1
00167      05  CURR-OLD-KEY.
00168          10  COLD-DIV    PIC 9(14)    VALUE ZEROES.
00169          10  COLD-PROP   PIC 9(15).
00170      05  PREV-OLD-KEY    PIC X(29)    VALUE LOW-VALUES.
00171      SKIP1
00172      05  SAVE-OLD-DIV    PIC 9(14)    VALUE ZEROES.
00173      05  SAVE-OLD-PROP   PIC 9(15)    VALUE ZEROES.
00174      SKIP1
00175      05  UNPK-DIVNO      PIC 9(14).
00176      05  FILLER REDEFINES UNPK-DIVNO.
00177          10  UNPK-DIV4   PIC 9999.
00178          10  FILLER      PIC 9(10).
00179      05  WS-F288-YEAR.
00180          10  WS-F288-CC  PIC 99.
00181          10  WS-F288-YR  PIC 99.
00182      05  WS-F288-YEAR-N REDEFINES WS-F288-YEAR PIC 9(4).
00183      05  WS-T288-YEAR.
00184          10  WS-T288-CC  PIC 99.
00185          10  WS-T288-YR  PIC 99.
00186      05  WS-T288-YEAR-N REDEFINES WS-T288-YEAR PIC 9(4).
00187      05  WS-D3M-YEAR.
00188          10  WS-D3M-CC     PIC 99.
00189          10  WS-D3M-YR     PIC 99.
00190      05  WS-D3M-YEAR-N REDEFINES WS-D3M-YEAR PIC 9(4).
00191
00192      05  DSP-DATE.
00193          10  DSP-MO                 PIC 99.
00194          10  FILLER                 PIC X         VALUE '/'.
00195          10  DSP-DA                 PIC 99.
00196          10  FILLER                 PIC X         VALUE '/'.
00197          10  DSP-YR                 PIC 99.
00198      05  ACPT-DATE                  PIC 9(6).
00199      05  ACPT-DATE-X REDEFINES ACPT-DATE.
00200          10  ACPT-YR                PIC 99.
00201          10  ACPT-MO                PIC 99.
00202          10  ACPT-DA                PIC 99.
00203      SKIP1
00204      05  HEADING1.
00205          10  FILLER          PIC X(45)   VALUE '  ASREA740-1'.
00206          10  FILLER          PIC X(70)   VALUE
00207              'OFFICE OF THE COOK COUNTY ASSESSOR'.
00208          10  FILLER          PIC X(5)    VALUE 'PAGE'.
00209          10  HD1-PAGE        PIC ZZZ,ZZ9.
00210      SKIP1
00211      05  HEADING1-2.
00212          10  FILLER          PIC X(45)   VALUE '  ASREA740-2'.
00213          10  FILLER          PIC X(70)   VALUE
00214              'OFFICE OF THE COOK COUNTY ASSESSOR'.
00215          10  FILLER          PIC X(5)    VALUE 'PAGE'.
00216          10  HD1-PAGE-2      PIC ZZZ,ZZ9.
00217      SKIP1
00218      05  HEADING1-3.
00219          10  FILLER          PIC X(45)   VALUE '  ASREA740-3'.
00220          10  FILLER          PIC X(70)   VALUE
00221              'OFFICE OF THE COOK COUNTY ASSESSOR'.
00222          10  FILLER          PIC X(5)    VALUE 'PAGE'.
00223          10  HD1-PAGE-3      PIC ZZZ,ZZ9.
00224      SKIP1
00225      05  HEADING2.
00226          10  FILLER          PIC X(7)    VALUE '  DATE'.
00227          10  HD2-DATE        PIC X(8).
00228          10  FILLER          PIC X(18)   VALUE SPACES.
00229          10  FILLER          PIC X(28)   VALUE
00230              'CREATE FROZEN VALUE FILE -'.
00231          10  FILLER          PIC X(35)   VALUE
00232              'DETAIL OF REASSESSMENT TOWNSHIP'.
00233      SKIP1
00234      05  HEADING2-2.
00235          10  FILLER          PIC X(7)    VALUE '  DATE'.
00236          10  HD2-DATE-2      PIC X(8).
00237          10  FILLER          PIC X(15)   VALUE SPACES.
00238          10  FILLER          PIC X(28)   VALUE
00239              'CREATE FROZEN VALUE FILE -'.
00240          10  FILLER          PIC X(41)   VALUE
00241              'ERROR REPORT OF REASSESSMENT TOWNSHIP'.
00242      SKIP1
00243      05  HEADING2-3.
00244          10  FILLER          PIC X(7)    VALUE '  DATE'.
00245          10  HD2-DATE-3      PIC X(8).
00246          10  FILLER          PIC X(12)   VALUE SPACES.
00247          10  FILLER          PIC X(28)   VALUE
00248              'CREATE FROZEN VALUE FILE -'.
00249          10  FILLER          PIC X(51)   VALUE
00250          'DIVISION NO. SUMMARY - REASSESSMENT TOWNSHIP'.
00251      SKIP1
00252      05  HEADING3.
00253          10  FILLER          PIC XX.
00254          10  HD3-MSG         PIC X(30)   VALUE SPACES.
00255      SKIP1
00256      05  HEADING3-3                      VALUE SPACES.
00257          10  FILLER          PIC XX.
00258          10  H3-MSG          PIC X(22).
00259          10  H3-1            PIC X(22).
00260          10  H3-2            PIC X(22).
00261          10  H3-3            PIC X(22).
00262          10  H3-4            PIC X(22).
00263          10  H3-5            PIC X(22).
00264      SKIP1
00265      05  HEADING4.
00266          10  FILLER          PIC X(39)   VALUE '  DIVISION'.
00267          10  FILLER          PIC X(46)   VALUE
00268              'P1 - 2-5 OVER 1YR        P2 - 288 W/PER'.
00269          10  FILLER          PIC X(46)   VALUE
00270              'P3 - 1 YR OLD          P4 - 1 YR OLD'.
00271      SKIP1
00272      05  HEADING5.
00273          10  FILLER          PIC X(43)   VALUE
00274              '    NUMBER        PROPERTY NUMBER'.
00275          10  FILLER          PIC X(42)   VALUE
00276              '288 N=CURRYR           FR/TO YRS '.
00277          10  FILLER          PIC X(35)   VALUE
00278              '     TYPE 2-5              TP 5 ACT'.
00279      SKIP1
00280      05  HEADING5B.
00281          10  FILLER          PIC X(43)   VALUE
00282              '    NUMBER        PROPERTY NUMBER'.
00283          10  FILLER          PIC X(42)   VALUE
00284              '288 CR YR-N PER            W/PER '.
00285          10  FILLER          PIC X(36)   VALUE
00286              'TYPE 2-5 ACT         FR-TO AGE - ACT'.
00287      SKIP1
00288      05  HEADING6.
00289          10  FILLER          PIC X(39)   VALUE SPACES.
00290          10  FILLER          PIC X(46)   VALUE
00291              'P5 - 1 YR OLD             P6 - DIFF 1 YR '.
00292          10  FILLER          PIC X(46)   VALUE
00293              'P7 - TOTAL LAND       P8 - TOTAL IMPV'.
00294      SKIP1
00295      05  HEADING7.
00296          10  FILLER          PIC X(44)   VALUE SPACES.
00297          10  FILLER          PIC X(46)   VALUE
00298              'TP 5 FULL                 TYPE 5   '.
00299          10  FILLER          PIC X(46)   VALUE
00300              'VALUATION             VALUATION'.
00301      SKIP1
00302      05  HEADING6B.
00303          10  FILLER          PIC X(39)   VALUE SPACES.
00304          10  FILLER          PIC X(46)   VALUE
00305              'P9 - TOTAL                P10 - TOTAL    '.
00306      SKIP1
00307      05  HEADING7B.
00308          10  FILLER          PIC X(44)   VALUE SPACES.
00309          10  FILLER          PIC X(46)   VALUE
00310              'VALUATION              PARCEL COUNT'.
00311      SKIP1
00312      05  HEADING8.
00313          10  FILLER          PIC X(39)   VALUE '  DIVISION'.
00314          10  FILLER          PIC X(46)   VALUE
00315              'C1 - 2-5 N/FR-TO        C2 - CUR YR 288'.
00316          10  FILLER          PIC X(46)   VALUE
00317              'C3 - 1 YR OLD          C4 - TYPE 2-5'.
00318      SKIP1
00319      05  HEADING10.
00320          10  FILLER          PIC X(39)   VALUE SPACES.
00321          10  FILLER          PIC X(46)   VALUE
00322              'C5 - DIFF 1 YR OLD        C6 - TOTAL LAND'.
00323          10  FILLER          PIC X(46)   VALUE
00324              'C7 - TOTAL IMPV           C8 - TOTAL'.
00325      SKIP1
00326      05  HEADING11.
00327          10  FILLER          PIC X(44).
00328          10  FILLER          PIC X(47)   VALUE
00329              'C4 - P3                   VALUATION'.
00330          10  FILLER          PIC X(46)   VALUE
00331              'VALUATION               VALUATION'.
00332      SKIP1
00333      05  HEADING12.
00334          10  FILLER          PIC X(39).
00335          10  FILLER          PIC X(46)   VALUE
00336              'C9 - PARCEL'.
00337      SKIP1
00338      05  HEADING13.
00339          10  FILLER          PIC X(44).
00340          10  FILLER          PIC X(46)   VALUE
00341              'COUNT'.
00342      SKIP1
00343      05  DETAIL-LINE-1                   VALUE SPACES.
00344          10  FILLER          PIC X.
00345          10  D-DIVNO-1       PIC 9(14).
00346          10  FILLER          PIC X.
00347          10  D-PROP-1        PIC 99,99,999,999,9999.
00348          10  FILLER          PIC XXX.
00349          10  D-P1VAL-1       PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.
00350          10  FILLER          PIC X(6).
00351          10  D-P2VAL-1       PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.
00352          10  FILLER          PIC XXXX.
00353          10  D-P3VAL-1       PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.
00354          10  FILLER          PIC X(6).
00355          10  D-P4VAL-1       PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.
00356          SKIP1
00357      05  DETAIL-LINE-2                   VALUE SPACES.
00358          10  FILLER          PIC X(37).
00359          10  D-P5VAL-2       PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.
00360          10  FILLER          PIC X(6).
00361          10  D-P6VAL-2       PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.
00362          10  FILLER          PIC XXXX.
00363          10  D-P7VAL-2       PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.
00364          10  FILLER          PIC X(6).
00365          10  D-P8VAL-2       PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.
00366          SKIP1
00367      05  DETAIL-LINE-3                   VALUE SPACES.
00368          10  FILLER          PIC X(37).
00369          10  D-C9VAL-3       PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.
00370          10  FILLER          PIC X(6).
00371          10  D-C10VAL-3      PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.
00372          SKIP1
00373      05  DETAIL-LINE-1-3                 VALUE SPACES.
00374          10  FILLER          PIC XXX.
00375          10  D1-DIVNO        PIC 9(14).
00376          10  FILLER          PIC X(6).
00377          10  D1-VAL3-TABLE OCCURS 5 TIMES.
00378              15 D1-FILLER    PIC X(4).
00379              15 D1-VAL-3     PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.
00380          SKIP1
00381      05  ERR-MSG-LINE.
00382          10  FILLER          PIC X(28).
00383          10  E-MSG           PIC X(63) VALUE
00384          '******  ACCUMULATED A/V NOT EQUAL TO TOTAL A/V  ******'.
00385         EJECT
00386  LINKAGE SECTION.
00387      SKIP1
00388  01  LINK-INFO.
00389      05  LINK-LENGTH         PIC S9(4)   BINARY.
00390          88  VAL-L-LENGTH                VALUE +12.
00391      05  LINK-PARM.
00392          10 LINK-CURRYR.
00393             15 LINK-CURRYR-N    PIC 99.
00394          10 LINK-FAGE.
00395             15 LINK-FAGE-N      PIC 999.
00396          10 LINK-TAGE.
00397             15 LINK-TAGE-N      PIC 999.
00398          10 LINK-F288-YR.
00399             15 LINK-F288-YR-N   PIC 99.
00400          10 LINK-T288-YR.
00401             15 LINK-T288-YR-N   PIC 99.
00402      SKIP2
00403  PROCEDURE DIVISION USING LINK-INFO.
00404      SKIP1
00405  010-HOUSEKEEPING.
00406      IF NOT VAL-L-LENGTH
00407         DISPLAY 'INVALID LINKAGE LENGTH'
00408         MOVE 16 TO RETURN-CODE
00409         STOP RUN.
00410      SKIP1
00411      IF LINK-CURRYR NOT NUMERIC
00412         DISPLAY 'CURRENT YEAR PARM MUST BE NUMERIC ' LINK-CURRYR
00413         MOVE 16 TO RETURN-CODE.
00414      SKIP1
00415      IF LINK-FAGE NUMERIC AND LINK-TAGE NUMERIC AND
00416         (LINK-FAGE NOT GREATER THAN LINK-TAGE)
00417         NEXT SENTENCE
00418      ELSE
00419         DISPLAY 'FROM AGE PARM MUST BE NUMERIC AND EQUAL TO OR LES
00420 -               'S THAN TO AGE    ' LINK-FAGE
00421         DISPLAY 'TO AGE PARM MUST BE NUMERIC AND EQUAL TO OR GREAT
00422 -               'ER THAN FROM AGE ' LINK-TAGE
00423         MOVE 16 TO RETURN-CODE.
00424      SKIP1
00425      MOVE LINK-F288-YR  TO WS-F288-YR.
00426      IF WS-F288-YR > 60
00427         MOVE 19  TO WS-F288-CC
00428      ELSE
00429         MOVE 20  TO WS-F288-CC
00430      END-IF
00431      MOVE LINK-T288-YR  TO WS-T288-YR.
00432      IF WS-T288-YR > 60
00433         MOVE 19  TO WS-T288-CC
00434      ELSE
00435         MOVE 20  TO WS-T288-CC
00436      END-IF
00437      IF WS-F288-YEAR-N NUMERIC AND WS-T288-YEAR-N NUMERIC AND
00438         (WS-F288-YEAR-N NOT GREATER THAN WS-T288-YEAR-N)
00439         NEXT SENTENCE
00440      ELSE
00441         DISPLAY 'FROM 288 YR PARM MUST BE NUMERIC AND EQUAL TO OR
00442 -               'LESS THAN TO 288 YR    ' LINK-F288-YR
00443         DISPLAY 'TO 288 YR PARM MUST BE NUMERIC AND EQUAL TO OR GR
00444 -               'EATER THAN FROM 288 YR ' LINK-T288-YR
00445         MOVE 16 TO RETURN-CODE.
00446      SKIP1
00447      IF RETURN-CODE = 16
00448         STOP RUN.
00449      SKIP1
00450      OPEN I-O FRZVALFL.
00451      IF NOT VALID-STATUS
00452         DISPLAY 'VSAM OPEN FROZEN VALUE FILE INVALID'
00453         DISPLAY 'FILE-STATUS = ' FILE-STATUS
00454         DISPLAY 'FILE-STATUS FEEDBACK = ' FILE-RETURN ' '
00455                  FILE-FUNCTION ' ' FILE-FEEDBACK
00456         MOVE 16 TO RETURN-CODE
00457         STOP RUN.
00458      SKIP1
00459      OPEN INPUT  MASTER-IN
00460                  MASTER-IN-BA
00461           OUTPUT PRINT-FILE
00462                  PRT-ERR-FILE
00463                  OUTPUT-FILE
00464                  PRT-DTL-FILE.
00465      SKIP1
00466      ACCEPT ACPT-DATE FROM DATE.
00467      MOVE ACPT-MO TO DSP-MO.
00468      MOVE ACPT-DA TO DSP-DA.
00469      MOVE ACPT-YR TO DSP-YR.
00470      MOVE DSP-DATE  TO HD2-DATE HD2-DATE-2 HD2-DATE-3.
00471      SKIP1
00472      WRITE PRINT-REC   FROM BLANK-LINE AFTER ADVANCING PAGE.
00473      WRITE PRT-DTL-REC FROM BLANK-LINE AFTER ADVANCING PAGE.
00474      WRITE PRT-ERR-REC FROM BLANK-LINE AFTER ADVANCING PAGE.
00475      SKIP1
00476      PERFORM 030-READ-ACCUM-NEW-MAST UNTIL SAVE-NEW-DIV NOT EQUAL
00477              TO CNEW-DIV.
00478      SKIP1
00479      PERFORM 040-READ-ACCUM-OLD-MAST UNTIL SAVE-OLD-DIV NOT EQUAL
00480              TO COLD-DIV.
00481      SKIP1
00482      PERFORM 020-MAINLINE UNTIL ERR OR (NEW-EOF AND OLD-EOF).
00483      SKIP1
00484      IF NOT ERR
00485         IF OLD-MAST-RECS > NEW-MAST-RECS
00486            NEXT SENTENCE
00487         ELSE
00488            IF SAVE-NEW-DIV = SAVE-OLD-DIV
00489               PERFORM 050-ACCUM-WRITE-CHECK
00490               PERFORM 060-ACCESS-FROZVAL-REPORT-RTN
00491            ELSE
00492               PERFORM 055-ACCUM-WRITE-CHECK-NEW
00493               PERFORM 060-ACCESS-FROZVAL-REPORT-RTN.
00494      SKIP1
00495      DISPLAY 'TOTAL MASTER OLD RECORDS READ
00496 -            ' ' OLD-MAST-RECS.
00497      DISPLAY 'TOTAL MASTER NEW RECORDS READ
00498 -            ' ' NEW-MAST-RECS.
00499      DISPLAY 'TOTAL MASTER OLD RECORDS WRITTEN TO OUTPUT REPORT 1
00500 -            ' ' RECS-WRIT-OLD-1.
00501      DISPLAY 'TOTAL MASTER NEW RECORDS WRITTEN TO OUTPUT REPORT 1
00502 -            ' ' RECS-WRIT-NEW-1.
00503      DISPLAY 'TOTAL MASTER OLD RECORDS WRITTEN TO OUTPUT REPORT 2
00504 -            ' ' RECS-WRIT-OLD-2.
00505      DISPLAY 'TOTAL MASTER NEW RECORDS WRITTEN TO OUTPUT REPORT 2
00506 -            ' ' RECS-WRIT-NEW-2.
00507      DISPLAY 'TOTAL MASTER RECORDS WRITTEN TO OUTPUT REPORT 3
00508 -            ' ' RECS-WRIT-3.
00509      DISPLAY 'TOTAL FROZEN VALUE RECORDS UPDATED
00510 -            ' ' RECS-UPD.
00511      DISPLAY 'TOTAL FROZEN VALUE RECORDS WRITTEN
00512 -            ' ' RECS-ADD.
00513      DISPLAY 'TOTAL OUTPUT FILE  RECORDS WRITTEN
00514 -            ' ' WS-OUT-CNT.
00515      SKIP1
00516      CLOSE MASTER-IN
00517            MASTER-IN-BA
00518            PRINT-FILE
00519            PRT-ERR-FILE
00520            PRT-DTL-FILE
00521            OUTPUT-FILE
00522            FRZVALFL.
00523      SKIP1
00524      IF NOT VALID-STATUS
00525         DISPLAY 'VSAM CLOSE FROZEN VALUE FILE INVALID'
00526         DISPLAY 'FILE-STATUS = ' FILE-STATUS
00527         DISPLAY 'FILE-STATUS FEEDBACK = ' FILE-RETURN ' '
00528                  FILE-FUNCTION ' ' FILE-FEEDBACK
00529         MOVE 16 TO RETURN-CODE.
00530      SKIP1
00531      STOP RUN.
00532      SKIP2
00533  020-MAINLINE.
00534      SKIP1
00535      IF NOT (ERR OR (NEW-EOF AND OLD-EOF))
00536         IF SAVE-NEW-DIV = SAVE-OLD-DIV
00537            PERFORM 050-ACCUM-WRITE-CHECK
00538            PERFORM 060-ACCESS-FROZVAL-REPORT-RTN
00539            PERFORM 023-ZERO-NEW
00540            PERFORM 031-ACCUM-NEW-MAST
00541            MOVE CNEW-DIV TO SAVE-NEW-DIV
00542            MOVE M-PROP   TO SAVE-NEW-PROP
00543            PERFORM 030-READ-ACCUM-NEW-MAST UNTIL SAVE-NEW-DIV
00544                    NOT EQUAL TO CNEW-DIV OR NEW-EOF
00545            PERFORM 025-ZERO-OLD
00546            PERFORM 041-ACCUM-OLD-MAST
00547            MOVE COLD-DIV TO SAVE-OLD-DIV
00548            MOVE MA-PROP  TO SAVE-OLD-PROP
00549            PERFORM 040-READ-ACCUM-OLD-MAST UNTIL SAVE-OLD-DIV
00550                    NOT EQUAL TO COLD-DIV OR OLD-EOF
00551         ELSE
00552            IF SAVE-NEW-DIV > SAVE-OLD-DIV
00553               PERFORM 025-ZERO-OLD
00554               PERFORM 041-ACCUM-OLD-MAST
00555               MOVE COLD-DIV TO SAVE-OLD-DIV
00556               MOVE MA-PROP  TO SAVE-OLD-PROP
00557               PERFORM 040-READ-ACCUM-OLD-MAST UNTIL SAVE-OLD-DIV
00558                       NOT EQUAL TO COLD-DIV OR OLD-EOF
00559            ELSE
00560               PERFORM 055-ACCUM-WRITE-CHECK-NEW
00561               PERFORM 060-ACCESS-FROZVAL-REPORT-RTN
00562               PERFORM 023-ZERO-NEW
00563               PERFORM 031-ACCUM-NEW-MAST
00564               MOVE CNEW-DIV TO SAVE-NEW-DIV
00565               MOVE M-PROP   TO SAVE-NEW-PROP
00566               PERFORM 030-READ-ACCUM-NEW-MAST UNTIL SAVE-NEW-DIV
00567                       NOT EQUAL TO CNEW-DIV OR NEW-EOF.
00568      SKIP2
00569  023-ZERO-NEW.
00570      MOVE '1' TO NEW-EXEMPT-SW
00571      MOVE '0' TO WS-288-IND-SW.
00572      MOVE 'N' TO WS-CHG-ACT-SW.
00573      MOVE ZEROES TO WS-C1 WS-C2 WS-C3 WS-C4 WS-C5 WS-C6 WS-C7
00574                     WS-C8 WS-C9.
00575      SKIP2
00576  025-ZERO-OLD.
00577      MOVE '1' TO OLD-EXEMPT-SW
00578      MOVE ZEROES TO WS-P1 WS-P2 WS-P3 WS-P4 WS-P5 WS-P6 WS-P7
00579                     WS-P8 WS-P9 WS-P10.
00580      SKIP2
00581  030-READ-ACCUM-NEW-MAST.
00582      PERFORM 035-READ-NEW-MAST.
00583      SKIP1
00584      IF NOT (ERR OR NEW-EOF)
00585         IF SAVE-NEW-DIV EQUAL CNEW-DIV
00586            PERFORM 031-ACCUM-NEW-MAST.
00587      SKIP2
00588  031-ACCUM-NEW-MAST.
00589      ADD +1 TO WS-C9.
00590      ADD M-VALUE (5) TO WS-C6.
00591      ADD M-VALUE (6) TO WS-C7.
00592      ADD M-VALUE (7) TO WS-C8.
00593      SKIP1
00594      IF M-PERMIND = 2 OR M-PERMIND = 3
00595         MOVE 'Y' TO WS-CHG-ACT-SW.
00596      IF NOT M-EXEMPT
00597         MOVE '0' TO NEW-EXEMPT-SW
00598      END-IF
00599      SKIP1
00600      IF M-DETAIL-PRESENT
00601         PERFORM 037-READ-NEW-DETAIL VARYING SUB FROM 1 BY 1
00602                 UNTIL SUB > M-DTL-QST-CTR.
00603      SKIP2
00604  035-READ-NEW-MAST.
00605      READ MASTER-IN
00606          AT END
00607             MOVE ALL '9' TO CURR-NEW-KEY
00608             MOVE 'Y'     TO NEW-EOF-SW.
00609              SKIP1
00610      IF NOT NEW-EOF
00611         ADD +1              TO NEW-MAST-RECS
00612         MOVE M-DIVNO-PROP   TO CNEW-DIV
00613         MOVE M-PROP         TO CNEW-PROP
00614         IF CURR-NEW-KEY NOT GREATER PREV-NEW-KEY
00615            DISPLAY 'NEW BA MAST FILE OUT OF SEQUENCE'
00616            DISPLAY 'CURRENT  KEY IS ' CURR-NEW-KEY
00617            DISPLAY 'PREVIOUS KEY IS ' PREV-NEW-KEY
00618            MOVE 16  TO RETURN-CODE
00619            MOVE 'Y' TO ERR-SW
00620         ELSE
00621            MOVE CURR-NEW-KEY TO PREV-NEW-KEY
00622            IF FIRST-REC-NEW
00623               MOVE M-DIVNO-PROP TO SAVE-NEW-DIV
00624               MOVE M-PROP       TO SAVE-NEW-PROP.
00625      SKIP2
00626  037-READ-NEW-DETAIL.
00627      IF D2-TYPE2-5 (SUB)
00628         MOVE D2-AGE (SUB) TO WS-AGE-CHECK
00629         MOVE D2-CLS (SUB) TO WS-CLS-CHECK
00630         IF ((D2-AGE (SUB) NOT LESS LINK-FAGE-N) AND
00631            (D2-AGE (SUB) NOT GREATER LINK-TAGE-N)) AND
00632            NOT WS-CLS-288
00633            ADD D2-VAL (SUB) TO WS-C4
00634         ELSE
00635            IF NOT WS-CLS-288 AND NOT WS-AGE-1
00636               ADD D2-VAL (SUB) TO WS-C1.
00637         SKIP1
00638      IF D2-TYPE2-5 (SUB)
00639         IF WS-AGE-1 AND NOT WS-CLS-288
00640            ADD D2-VAL (SUB) TO WS-C3.
00641      SKIP1
00642      IF D2-TYPE2-5 (SUB)
00643         IF D3-TYPE3 (SUB)
00644            IF WS-CLS-288 AND (D3-YR (SUB) = LINK-CURRYR-N)
00645               AND (M-PERMIND = '2')
00646               ADD D3-VAL (SUB) TO WS-C2
00647               MOVE '1' TO WS-288-IND-SW
00648            ELSE
00649               IF WS-CLS-288 AND (D3-YR (SUB) = LINK-CURRYR-N)
00650                  AND (M-PERMIND NOT EQUAL '2')
00651                  ADD D3-VAL (SUB) TO WS-C1
00652                  IF M-PERMIND = '3'
00653                     MOVE '1' TO WS-288-IND-SW
00654                  ELSE
00655                     NEXT SENTENCE
00656               ELSE
00657                  IF WS-CLS-288 AND (D3-YR (SUB) NOT =
00658                     LINK-CURRYR-N)
00659                     ADD D3-VAL (SUB) TO WS-C1.
00660      SKIP1
00661      IF D2-QUES-CLASS (SUB)
00662         ADD +1 TO SUB.
00663      SKIP2
00664  040-READ-ACCUM-OLD-MAST.
00665      PERFORM 045-READ-OLD-MAST.
00666      SKIP1
00667      IF NOT (ERR OR OLD-EOF)
00668         IF SAVE-OLD-DIV EQUAL COLD-DIV
00669            PERFORM 041-ACCUM-OLD-MAST.
00670      SKIP2
00671  041-ACCUM-OLD-MAST.
00672      ADD +1 TO WS-P10.
00673      ADD MA-VALUE-1 (5) TO WS-P7.
00674      ADD MA-VALUE-1 (6) TO WS-P8.
00675      ADD MA-VALUE-1 (7) TO WS-P9.
00676      IF NOT MA-EXEMPT
00677         MOVE '0' TO OLD-EXEMPT-SW
00678      END-IF
00679      IF MA-DETAIL-PRESENT
00680         PERFORM 047-READ-OLD-DETAIL VARYING SUBO FROM 1 BY 1
00681                 UNTIL SUBO > MA-DTL-QST-CTR-1.
00682      SKIP2
00683  045-READ-OLD-MAST.
00684      READ MASTER-IN-BA
00685          AT END
00686             MOVE ALL '9' TO CURR-OLD-KEY
00687             MOVE 'Y'     TO OLD-EOF-SW.
00688              SKIP1
00689      IF NOT OLD-EOF
00690         ADD +1               TO OLD-MAST-RECS
00691         MOVE MA-DIVNO-PROP   TO COLD-DIV
00692         MOVE MA-PROP         TO COLD-PROP
00693         IF CURR-OLD-KEY NOT GREATER PREV-OLD-KEY
00694            DISPLAY 'OLD BA MAST FILE OUT OF SEQUENCE'
00695            DISPLAY 'CURRENT  KEY IS ' CURR-OLD-KEY
00696            DISPLAY 'PREVIOUS KEY IS ' PREV-OLD-KEY
00697            MOVE 16  TO RETURN-CODE
00698            MOVE 'Y' TO ERR-SW
00699         ELSE
00700            MOVE CURR-OLD-KEY TO PREV-OLD-KEY
00701            IF FIRST-REC-OLD
00702               MOVE MA-DIVNO-PROP TO SAVE-OLD-DIV
00703               MOVE MA-PROP       TO SAVE-OLD-PROP.
00704      SKIP2
00705  047-READ-OLD-DETAIL.
00706      IF D2M-TYPE2-5 (SUBO)
00707         MOVE D2M-AGE (SUBO) TO WS-AGE-CHECK
00708         MOVE D2M-CLS (SUBO) TO WS-CLS-CHECK
00709         IF WS-AGE-2-999 AND NOT WS-CLS-288
00710            ADD D2M-VAL (SUBO) TO WS-P1
00711         ELSE
00712            IF WS-AGE-1 AND NOT WS-CLS-288
00713               ADD D2M-VAL (SUBO) TO WS-P3.
00714      SKIP1
00715      IF D2M-TYPE2-5 (SUBO)
00716         IF D5M-TYPE5 (SUBO) AND WS-AGE-1
00717            ADD D2M-VAL (SUBO) TO WS-P4
00718            IF D5M-OCCFAC (SUBO) > 0
00719              COMPUTE TYPE4-SUM = (D5M-REPCST (SUBO) * 100) /
00720                                    D5M-OCCFAC (SUBO)
00721            ELSE
00722               MOVE D5M-REPCST (SUBO) TO TYPE4-SUM
00723            END-IF
00724            COMPUTE TYPE4-SUM2 =
00725                    (TYPE4-SUM * D5M-COND (SUBO)) / 100
00726            IF D5M-PCASSD (SUBO) > 0
00727               COMPUTE TYPE5-SUM =
00728                       (TYPE4-SUM2 * D5M-PCASSD (SUBO)) / 100
00729            ELSE
00730               MOVE TYPE4-SUM2 TO TYPE5-SUM
00731            END-IF
00732            ADD TYPE5-SUM TO WS-P5.
00733      SKIP1
00734      IF D2M-TYPE2-5 (SUBO)
00735         IF D3M-TYPE3 (SUBO) AND WS-CLS-288
00736            MOVE D3M-YR (SUBO) TO WS-D3M-YR
00737            IF WS-D3M-YR > 60
00738               MOVE 19   TO  WS-D3M-CC
00739            ELSE
00740               MOVE 20   TO  WS-D3M-CC
00741            END-IF
00742 *          IF ((D3M-YR (SUBO) NOT LESS LINK-F288-YR-N) AND
00743 *             (D3M-YR (SUBO) NOT GREATER LINK-T288-YR-N))
00744            IF ((WS-D3M-YEAR-N NOT LESS WS-F288-YEAR-N) AND
00745               (WS-D3M-YEAR-N NOT GREATER WS-T288-YEAR-N))
00746               IF (D3M-PI (SUBO) = '2')
00747                  IF D3M-VAL (SUBO) = ZEROES
00748                     COMPUTE TYPE3-SUM =
00749                     (D3M-REPCST (SUBO) * D3M-COND (SUBO)) / 100
00750                     IF D3M-PCASSD (SUBO) > 0
00751                        COMPUTE TYPE3-SUM2 =
00752                              (TYPE3-SUM * D3M-PCASSD (SUBO)) / 100
00753                        ADD TYPE3-SUM2 TO WS-P2
00754                     ELSE
00755                        ADD TYPE3-SUM  TO WS-P2
00756                  ELSE
00757                     ADD D3M-VAL (SUBO) TO WS-P1
00758                     ADD 4800           TO WS-P2
00759               ELSE
00760                  ADD D3M-VAL (SUBO) TO WS-P1
00761            ELSE
00762               ADD D3M-VAL (SUBO) TO WS-P1.
00763      SKIP1
00764      IF D2M-QUES-CLASS (SUBO)
00765         ADD +1 TO SUBO.
00766      SKIP2
00767  050-ACCUM-WRITE-CHECK.
00768      MOVE 'N' TO PRINT-ERR-MSG-SW PRINT-REP-2-SW.
00769      SKIP1
00770      COMPUTE WS-P5-P4 = WS-P5 - WS-P4.
00771      IF WS-P5-P4 > 0
00772         ADD WS-P5-P4 TO WS-P6
00773      ELSE
00774         CONTINUE
00775      END-IF
00776      COMPUTE WS-C4-P3 = WS-C4 - WS-P3
00777      IF WS-C4-P3 > 0
00778         ADD WS-C4-P3 TO WS-C5
00779      ELSE
00780         CONTINUE
00781      END-IF
00782      COMPUTE WS-P1P3 = WS-P1 + WS-P3
00783      IF WS-P1P3 = WS-P8
00784         CONTINUE
00785      ELSE
00786         MOVE 'Y' TO PRINT-ERR-MSG-SW
00787         MOVE 'Y' TO PRINT-REP-2-SW
00788         PERFORM 120-MOVE-DETAIL-REPORT-1-OLD
00789      END-IF
00790      MOVE 'N' TO PRINT-REP-2-SW
00791      PERFORM 120-MOVE-DETAIL-REPORT-1-OLD
00792      MOVE 'N' TO PRINT-ERR-MSG-SW
00793      COMPUTE WS-C1C2C3C4 = WS-C1 + WS-C2 + WS-C3 + WS-C4
00794      IF WS-C1C2C3C4 = WS-C7
00795         CONTINUE
00796      ELSE
00797         MOVE 'Y' TO PRINT-ERR-MSG-SW
00798         MOVE 'Y' TO PRINT-REP-2-SW
00799         PERFORM 110-MOVE-DETAIL-REPORT-1-NEW
00800      END-IF
00801      MOVE 'N' TO PRINT-REP-2-SW
00802      PERFORM 110-MOVE-DETAIL-REPORT-1-NEW.
00803      SKIP2
00804  055-ACCUM-WRITE-CHECK-NEW.
00805      MOVE 'N' TO PRINT-ERR-MSG-SW PRINT-REP-2-SW.
00806      SKIP1
00807      MOVE 'NO PRIOR RECORD (NO OLD)'    TO HD3-MSG.
00808      PERFORM 140-PRT-DET-HEAD-OLD.
00809      SKIP1
00810      COMPUTE WS-C1C2C3C4 = WS-C1 + WS-C2 + WS-C3 + WS-C4
00811      IF WS-C1C2C3C4 = WS-C7
00812         CONTINUE
00813      ELSE
00814         MOVE 'Y' TO PRINT-ERR-MSG-SW
00815         MOVE 'Y' TO PRINT-REP-2-SW
00816         PERFORM 110-MOVE-DETAIL-REPORT-1-NEW
00817      END-IF
00818      MOVE 'N' TO PRINT-REP-2-SW
00819      PERFORM 110-MOVE-DETAIL-REPORT-1-NEW.
00820      SKIP2
00821  060-ACCESS-FROZVAL-REPORT-RTN.
00822      PERFORM 070-RAND-READ-FROZEN-VAL-FILE.
00823      IF NOT ERR
00824         IF FRZVAL-FILE-FND
00825            PERFORM 080-PREPARE-FROZEN-VAL
00826            PERFORM 130-WRITE-DETAIL-REPORT-3
00827            PERFORM 090-REWRITE-FRZVAL-FILE
00828         ELSE
00829            PERFORM 075-PREPARE-WRITE-FROZEN-VAL
00830            PERFORM 080-PREPARE-FROZEN-VAL
00831            IF FV-PROP-IMP-VAL = 0 AND FV-PROP-EXPR-288-VAL = 0 AND
00832               FV-PROP-CURR-288-VAL = 0 AND FV-PROP-TOT-VAL = 0 AND
00833               FV-PROP-ACT-VAL = 0
00834               NEXT SENTENCE
00835            ELSE
00836               PERFORM 130-WRITE-DETAIL-REPORT-3
00837               PERFORM 100-WRITE-FRZVAL-FILE.
00838        SKIP2
00839  070-RAND-READ-FROZEN-VAL-FILE.
00840      MOVE SAVE-NEW-DIV TO FV-DIVNO.
00841      SKIP1
00842      READ FRZVALFL.
00843      IF VALID-STATUS
00844         MOVE 'F' TO FRZVAL-FILE-FND-SW
00845      ELSE
00846         IF STREPT-NOTFND
00847            MOVE 'N' TO FRZVAL-FILE-FND-SW
00848         ELSE
00849            DISPLAY 'VSAM READ FOR FROZEN VALUATION FILE'
00850            DISPLAY 'FILE-STATUS = ' FILE-STATUS
00851            DISPLAY 'FILE-STATUS FEEDBACK = ' FILE-RETURN ' '
00852                     FILE-FUNCTION ' ' FILE-FEEDBACK
00853            MOVE 'Y' TO ERR-SW
00854            MOVE 16 TO RETURN-CODE.
00855      SKIP2
00856  075-PREPARE-WRITE-FROZEN-VAL.
00857      MOVE SAVE-NEW-DIV TO FV-DIVNO.
00858      SKIP1
00859      PERFORM 200-INITIAL-VALUES VARYING SUBT FROM 1 BY 1 UNTIL
00860              SUBT > 29.
00861         SKIP2
00862  080-PREPARE-FROZEN-VAL.
00863      ADD WS-P7   TO FV-PRIOR-LND-VAL.
00864      ADD WS-P8   TO FV-PRIOR-IMP-VAL.
00865      ADD WS-P9   TO FV-PRIOR-TOT-VAL.
00866      ADD WS-P10  TO FV-PRIOR-PCL.
00867      ADD WS-C6   TO FV-CURR-LND-VAL.
00868      ADD WS-C7   TO FV-CURR-IMP-VAL.
00869      ADD WS-C8   TO FV-CURR-TOT-VAL
00870      ADD WS-C9   TO FV-CURR-PCL.
00871      IF OLD-EXEMPT AND NOT-NEW-EXEMPT
00872         ADD WS-C8 TO FV-PROP-IMP-VAL
00873         ADD WS-C8 TO FV-PROP-TOT-VAL
00874      ELSE
00875         ADD WS-C2   TO FV-PROP-CURR-288-VAL FV-PROP-TOT-VAL
00876         ADD WS-P2   TO FV-PROP-EXPR-288-VAL FV-PROP-TOT-VAL
00877         ADD WS-C3   TO FV-PROP-IMP-VAL      FV-PROP-TOT-VAL
00878         IF (WS-C5 GREATER ZERO)
00879            IF WS-C5 < WS-P6
00880               ADD WS-C5 TO FV-PROP-IMP-VAL FV-PROP-TOT-VAL
00881            ELSE
00882               ADD WS-P6 TO FV-PROP-IMP-VAL FV-PROP-TOT-VAL
00883            END-IF
00884            IF (WS-C2 GREATER ZERO) OR (WS-C3 GREATER ZERO) OR
00885               (WS-C5 GREATER ZERO)
00886               ADD WS-P7  TO FV-CA-PR-LND-VAL FV-CA-PR-TOT-VAL
00887               ADD WS-C6  TO FV-CA-CR-LND-VAL FV-CA-CR-TOT-VAL
00888               COMPUTE WS-C7-C2-C3 = WS-C7 - WS-C2 - WS-C3
00889               ADD WS-C7-C2-C3  TO FV-CA-CR-IMP-VAL
00890                  FV-CA-CR-TOT-VAL
00891               ADD WS-P8 TO FV-CA-PR-IMP-VAL FV-CA-PR-TOT-VAL
00892            ELSE
00893               IF WS-288-IND-1 OR WS-CHG-ACT-Y
00894                  PERFORM 085-ADD-RTN
00895               ELSE
00896                  IF UNPK-DIV4 = ZEROES
00897                     PERFORM 085-ADD-RTN
00898                  ELSE
00899                     ADD WS-P7  TO FV-WOCA-PR-LND-VAL
00900                     ADD WS-P8  TO FV-WOCA-PR-IMP-VAL
00901                     ADD WS-P9  TO FV-WOCA-PR-TOT-VAL
00902                     ADD WS-P10 TO FV-WOCA-PR-PCL
00903                     ADD WS-C6  TO FV-WOCA-CR-LND-VAL
00904                     ADD WS-C7  TO FV-WOCA-CR-IMP-VAL
00905                     ADD WS-C8  TO FV-WOCA-CR-TOT-VAL
00906                     ADD WS-C9  TO FV-WOCA-CR-PCL.
00907              SKIP2
00908  085-ADD-RTN.
00909      ADD WS-P7  TO FV-CA-PR-LND-VAL.
00910      ADD WS-P8  TO FV-CA-PR-IMP-VAL.
00911      ADD WS-P9  TO FV-CA-PR-TOT-VAL.
00912      ADD WS-P10 TO FV-CA-PR-PCL.
00913      ADD WS-C6  TO FV-CA-CR-LND-VAL.
00914      ADD WS-C7  TO FV-CA-CR-IMP-VAL.
00915      ADD WS-C8  TO FV-CA-CR-TOT-VAL.
00916      ADD WS-C9  TO FV-CA-CR-PCL.
00917         SKIP2
00918  090-REWRITE-FRZVAL-FILE.
00919      REWRITE FRZVALREC.
00920      IF VALID-STATUS
00921         ADD +1 TO RECS-UPD
00922      ELSE
00923         DISPLAY 'VSAM REWRITE FOR FROZEN VALUE FILE INVALID'
00924         DISPLAY 'FILE-STATUS = ' FILE-STATUS
00925         DISPLAY 'FILE-STATUS FEEDBACK = ' FILE-RETURN ' '
00926                  FILE-FUNCTION ' ' FILE-FEEDBACK
00927         MOVE 'Y' TO ERR-SW
00928         MOVE 16 TO RETURN-CODE.
00929      SKIP2
00930  100-WRITE-FRZVAL-FILE.
00931      WRITE FRZVALREC.
00932      IF VALID-STATUS
00933         ADD +1 TO RECS-ADD
00934      ELSE
00935         DISPLAY 'VSAM WRITE FOR FROZEN VALUE FILE INVALID'
00936         DISPLAY 'FILE-STATUS = ' FILE-STATUS
00937         DISPLAY 'FILE-STATUS FEEDBACK = ' FILE-RETURN ' '
00938                  FILE-FUNCTION ' ' FILE-FEEDBACK
00939         MOVE 'Y' TO ERR-SW
00940         MOVE 16 TO RETURN-CODE.
00941      SKIP2
00942  110-MOVE-DETAIL-REPORT-1-NEW.
00943      MOVE SAVE-NEW-DIV   TO D-DIVNO-1.
00944      MOVE SAVE-NEW-PROP  TO D-PROP-1.
00945      INSPECT D-PROP-1 REPLACING ALL ',' BY '-'.
00946      MOVE WS-C1          TO D-P1VAL-1.
00947      MOVE WS-C2          TO D-P2VAL-1.
00948      MOVE WS-C3          TO D-P3VAL-1.
00949      MOVE WS-C4          TO D-P4VAL-1.
00950      MOVE WS-C5          TO D-P5VAL-2.
00951      MOVE WS-C6          TO D-P6VAL-2.
00952      MOVE WS-C7          TO D-P7VAL-2.
00953      MOVE WS-C8          TO D-P8VAL-2.
00954      MOVE WS-C9          TO D-C9VAL-3.
00955      MOVE 'CURRENT RECORD (MASTER NEW)' TO HD3-MSG.
00956      IF WS-C3 > 0
00957         INITIALIZE OUTPUT-REC
00958         MOVE SAVE-NEW-PROP  TO  OUT-PROP
00959         MOVE WS-C3          TO  OUT-PROP-IMPV
00960         MOVE WS-C5          TO  OUT-PROP-CURR-288
00961         ADD +1 TO WS-OUT-CNT
00962         WRITE OUTPUT-REC
00963      END-IF
00964      SKIP1
00965      IF PRINT-REP-2
00966         PERFORM 160-PRT-DET-HEAD-2-NEW
00967      ELSE
00968         PERFORM 155-PRT-DET-HEAD-NEW.
00969      SKIP2
00970  120-MOVE-DETAIL-REPORT-1-OLD.
00971      MOVE SAVE-OLD-DIV    TO D-DIVNO-1.
00972      MOVE SAVE-OLD-PROP   TO D-PROP-1.
00973      INSPECT D-PROP-1 REPLACING ALL ',' BY '-'.
00974      MOVE WS-P1          TO D-P1VAL-1.
00975      MOVE WS-P2          TO D-P2VAL-1.
00976      MOVE WS-P3          TO D-P3VAL-1.
00977      MOVE WS-P4          TO D-P4VAL-1.
00978      MOVE WS-P5          TO D-P5VAL-2.
00979      MOVE WS-P6          TO D-P6VAL-2.
00980      MOVE WS-P7          TO D-P7VAL-2.
00981      MOVE WS-P8          TO D-P8VAL-2.
00982      MOVE WS-P9          TO D-C9VAL-3.
00983      MOVE WS-P10         TO D-C10VAL-3.
00984      MOVE 'PRIOR  RECORD  (MASTER OLD)' TO HD3-MSG.
00985      SKIP1
00986      IF PRINT-REP-2
00987         PERFORM 150-PRT-DET-HEAD-2-OLD
00988      ELSE
00989         PERFORM 140-PRT-DET-HEAD-OLD.
00990      SKIP2
00991  130-WRITE-DETAIL-REPORT-3.
00992      PERFORM 190-HEADING-RTN-3.
00993      SKIP1
00994      MOVE +0 TO SUBD.
00995      MOVE SPACES TO DETAIL-LINE-1-3.
00996      MOVE FV-DIVNO TO D1-DIVNO.
00997      SKIP1
00998      PERFORM 300-INITIAL-VALUES-DET VARYING SUBT FROM 1 BY 1
00999              UNTIL SUBT > 5.
01000      PERFORM 135-MOVE-VALUES VARYING SUBV FROM 1 BY 1 UNTIL
01001              SUBV > 5.
01002      WRITE PRT-DTL-REC FROM DETAIL-LINE-1-3 AFTER ADVANCING 2.
01003      SKIP1
01004      MOVE ' CURR IMPV VALUE' TO H3-1.
01005      MOVE 'CURR TOTAL VALUE' TO H3-2.
01006      MOVE ' CURR PCL COUNT ' TO H3-3.
01007      MOVE 'PROP ASSD 1ST IMP' TO H3-4.
01008      MOVE ' AS 1ST EXPR 288' TO H3-5.
01009      WRITE PRT-DTL-REC FROM HEADING3-3 AFTER ADVANCING 3.
01010      WRITE PRT-DTL-REC FROM BLANK-LINE AFTER ADVANCING 1.
01011      MOVE SPACES TO HEADING3-3.
01012      SKIP1
01013      MOVE +0 TO SUBD.
01014      MOVE SPACES TO DETAIL-LINE-1-3.
01015      PERFORM 300-INITIAL-VALUES-DET VARYING SUBT FROM 1 BY 1
01016              UNTIL SUBT > 5.
01017      PERFORM 135-MOVE-VALUES VARYING SUBV FROM 6 BY 1 UNTIL
01018              SUBV > 10.
01019      WRITE PRT-DTL-REC FROM DETAIL-LINE-1-3 AFTER ADVANCING 2.
01020      SKIP1
01021      MOVE ' AS 1ST CURR 288' TO H3-1.
01022      MOVE 'PROP ASSD 1ST TOT' TO H3-2.
01023      MOVE 'ASSD 1ST ACT TOT' TO H3-3.
01024      MOVE 'W/CHG ACT PR LAND' TO H3-4.
01025      MOVE 'W/CHG ACT PR IMPV' TO H3-5.
01026      WRITE PRT-DTL-REC FROM HEADING3-3 AFTER ADVANCING 3.
01027      WRITE PRT-DTL-REC FROM BLANK-LINE AFTER ADVANCING 1.
01028      MOVE SPACES TO HEADING3-3.
01029      SKIP1
01030      MOVE +0 TO SUBD.
01031      MOVE SPACES TO DETAIL-LINE-1-3.
01032      PERFORM 300-INITIAL-VALUES-DET VARYING SUBT FROM 1 BY 1
01033              UNTIL SUBT > 5.
01034      PERFORM 135-MOVE-VALUES VARYING SUBV FROM 11 BY 1 UNTIL
01035              SUBV > 15.
01036      WRITE PRT-DTL-REC FROM DETAIL-LINE-1-3 AFTER ADVANCING 2.
01037      SKIP1
01038      MOVE 'W/CHG ACT PR TOT' TO H3-1.
01039      MOVE 'W/CHG ACT PR CNT' TO H3-2.
01040      MOVE 'W/CHG ACT CR LAND' TO H3-3.
01041      MOVE 'W/CHG ACT CR IMPV' TO H3-4.
01042      MOVE 'W/CHG ACT CR TOT ' TO H3-5.
01043      WRITE PRT-DTL-REC FROM HEADING3-3 AFTER ADVANCING 3.
01044      WRITE PRT-DTL-REC FROM BLANK-LINE AFTER ADVANCING 1.
01045      MOVE SPACES TO HEADING3-3.
01046      SKIP1
01047      MOVE +0 TO SUBD.
01048      MOVE SPACES TO DETAIL-LINE-1-3.
01049      PERFORM 300-INITIAL-VALUES-DET VARYING SUBT FROM 1 BY 1
01050              UNTIL SUBT > 5.
01051      PERFORM 135-MOVE-VALUES VARYING SUBV FROM 16 BY 1 UNTIL
01052              SUBV > 20.
01053      WRITE PRT-DTL-REC FROM DETAIL-LINE-1-3 AFTER ADVANCING 2.
01054      SKIP1
01055      MOVE 'W/CHG ACT CR CNT' TO H3-1.
01056      MOVE 'W/O ACT PR LAND' TO H3-2.
01057      MOVE 'W/O ACT PR IMPV' TO H3-3.
01058      MOVE 'W/O ACT PR TOTAL' TO H3-4.
01059      MOVE 'W/O ACT PR CNT' TO H3-5.
01060      WRITE PRT-DTL-REC FROM HEADING3-3 AFTER ADVANCING 3.
01061      WRITE PRT-DTL-REC FROM BLANK-LINE AFTER ADVANCING 1.
01062      MOVE SPACES TO HEADING3-3.
01063      SKIP1
01064      MOVE +0 TO SUBD.
01065      MOVE SPACES TO DETAIL-LINE-1-3.
01066      PERFORM 300-INITIAL-VALUES-DET VARYING SUBT FROM 1 BY 1
01067              UNTIL SUBT > 5.
01068      PERFORM 135-MOVE-VALUES VARYING SUBV FROM 21 BY 1 UNTIL
01069              SUBV > 25.
01070      WRITE PRT-DTL-REC FROM DETAIL-LINE-1-3 AFTER ADVANCING 2.
01071      SKIP1
01072      MOVE 'W/O ACT CR LAND' TO H3-1.
01073      MOVE 'W/O ACT CR IMPV' TO H3-2.
01074      MOVE 'W/O ACT CR TOT ' TO H3-3.
01075      MOVE 'W/O ACT CR CNT  ' TO H3-4.
01076      WRITE PRT-DTL-REC FROM HEADING3-3 AFTER ADVANCING 3.
01077      WRITE PRT-DTL-REC FROM BLANK-LINE AFTER ADVANCING 1.
01078      MOVE SPACES TO HEADING3-3.
01079      SKIP1
01080      MOVE +0 TO SUBD.
01081      MOVE SPACES TO DETAIL-LINE-1-3.
01082      PERFORM 300-INITIAL-VALUES-DET VARYING SUBT FROM 1 BY 1
01083              UNTIL SUBT > 4.
01084      PERFORM 135-MOVE-VALUES VARYING SUBV FROM 26 BY 1 UNTIL
01085              SUBV > 29.
01086      WRITE PRT-DTL-REC FROM DETAIL-LINE-1-3 AFTER ADVANCING 2.
01087      SKIP1
01088      ADD +1  TO RECS-WRIT-3.
01089      SKIP2
01090  135-MOVE-VALUES.
01091      ADD +1 TO SUBD.
01092      MOVE FV-VAL (SUBV) TO D1-VAL-3 (SUBD).
01093      SKIP2
01094  140-PRT-DET-HEAD-OLD.
01095      IF LINE-CNTR = +2
01096         PERFORM 170-HEADING-RTN.
01097         SKIP1
01098      WRITE PRINT-REC FROM HEADING3       AFTER ADVANCING 3.
01099      WRITE PRINT-REC FROM HEADING4       AFTER ADVANCING 2.
01100      WRITE PRINT-REC FROM HEADING5       AFTER ADVANCING 1.
01101      WRITE PRINT-REC FROM DETAIL-LINE-1  AFTER ADVANCING 2.
01102      WRITE PRINT-REC FROM HEADING6       AFTER ADVANCING 3.
01103      WRITE PRINT-REC FROM HEADING7       AFTER ADVANCING 1.
01104      WRITE PRINT-REC FROM DETAIL-LINE-2  AFTER ADVANCING 2.
01105      WRITE PRINT-REC FROM HEADING6B      AFTER ADVANCING 3.
01106      WRITE PRINT-REC FROM HEADING7B      AFTER ADVANCING 1.
01107      WRITE PRINT-REC FROM DETAIL-LINE-3  AFTER ADVANCING 2.
01108      MOVE SPACES TO DETAIL-LINE-1 DETAIL-LINE-2 DETAIL-LINE-3.
01109      IF PRINT-ERR-MSG
01110         WRITE PRINT-REC FROM ERR-MSG-LINE AFTER ADVANCING 3.
01111         SKIP1
01112      ADD +1  TO RECS-WRIT-OLD-1.
01113      ADD +1  TO LINE-CNTR.
01114      SKIP2
01115  150-PRT-DET-HEAD-2-OLD.
01116      IF LINE-CNTR-2 = +2
01117         PERFORM 180-HEADING-RTN-2.
01118         SKIP1
01119      WRITE PRT-ERR-REC FROM HEADING3       AFTER ADVANCING 3.
01120      WRITE PRT-ERR-REC FROM HEADING4       AFTER ADVANCING 2.
01121      WRITE PRT-ERR-REC FROM HEADING5       AFTER ADVANCING 1.
01122      WRITE PRT-ERR-REC FROM DETAIL-LINE-1  AFTER ADVANCING 2.
01123      WRITE PRT-ERR-REC FROM HEADING6       AFTER ADVANCING 3.
01124      WRITE PRT-ERR-REC FROM HEADING7       AFTER ADVANCING 1.
01125      WRITE PRT-ERR-REC FROM DETAIL-LINE-2  AFTER ADVANCING 2.
01126      WRITE PRT-ERR-REC FROM HEADING6B      AFTER ADVANCING 3.
01127      WRITE PRT-ERR-REC FROM HEADING7B      AFTER ADVANCING 1.
01128      WRITE PRT-ERR-REC FROM DETAIL-LINE-3  AFTER ADVANCING 2.
01129      MOVE SPACES TO DETAIL-LINE-1 DETAIL-LINE-2 DETAIL-LINE-3.
01130      IF PRINT-ERR-MSG
01131         WRITE PRT-ERR-REC FROM ERR-MSG-LINE AFTER ADVANCING 3.
01132         SKIP1
01133      ADD +1  TO RECS-WRIT-OLD-2.
01134      ADD +1  TO LINE-CNTR-2.
01135      SKIP2
01136  155-PRT-DET-HEAD-NEW.
01137      IF LINE-CNTR = +2
01138         PERFORM 170-HEADING-RTN.
01139         SKIP1
01140      WRITE PRINT-REC FROM HEADING3      AFTER ADVANCING 3.
01141      WRITE PRINT-REC FROM HEADING8      AFTER ADVANCING 2.
01142      WRITE PRINT-REC FROM HEADING5B     AFTER ADVANCING 1.
01143      WRITE PRINT-REC FROM DETAIL-LINE-1 AFTER ADVANCING 2.
01144      WRITE PRINT-REC FROM HEADING10     AFTER ADVANCING 3.
01145      WRITE PRINT-REC FROM HEADING11     AFTER ADVANCING 1.
01146      WRITE PRINT-REC FROM DETAIL-LINE-2 AFTER ADVANCING 2.
01147      WRITE PRINT-REC FROM HEADING12     AFTER ADVANCING 3.
01148      WRITE PRINT-REC FROM HEADING13     AFTER ADVANCING 1.
01149      WRITE PRINT-REC FROM DETAIL-LINE-3 AFTER ADVANCING 2.
01150      MOVE SPACES TO DETAIL-LINE-1 DETAIL-LINE-2 DETAIL-LINE-3.
01151      IF PRINT-ERR-MSG
01152         WRITE PRINT-REC FROM ERR-MSG-LINE AFTER ADVANCING 3.
01153         SKIP1
01154      ADD +1  TO RECS-WRIT-NEW-1.
01155      ADD +1  TO LINE-CNTR.
01156      SKIP2
01157  160-PRT-DET-HEAD-2-NEW.
01158      IF LINE-CNTR-2 = +2
01159         PERFORM 180-HEADING-RTN-2.
01160         SKIP1
01161      WRITE PRT-ERR-REC FROM HEADING3      AFTER ADVANCING 3.
01162      WRITE PRT-ERR-REC FROM HEADING8      AFTER ADVANCING 2.
01163      WRITE PRT-ERR-REC FROM HEADING5B     AFTER ADVANCING 1.
01164      WRITE PRT-ERR-REC FROM DETAIL-LINE-1 AFTER ADVANCING 2.
01165      WRITE PRT-ERR-REC FROM HEADING10     AFTER ADVANCING 3.
01166      WRITE PRT-ERR-REC FROM HEADING11     AFTER ADVANCING 1.
01167      WRITE PRT-ERR-REC FROM DETAIL-LINE-2 AFTER ADVANCING 2.
01168      WRITE PRT-ERR-REC FROM HEADING12     AFTER ADVANCING 3.
01169      WRITE PRT-ERR-REC FROM HEADING13     AFTER ADVANCING 1.
01170      WRITE PRT-ERR-REC FROM DETAIL-LINE-3 AFTER ADVANCING 2.
01171      MOVE SPACES TO DETAIL-LINE-1 DETAIL-LINE-2 DETAIL-LINE-3.
01172      IF PRINT-ERR-MSG
01173         WRITE PRT-ERR-REC FROM ERR-MSG-LINE AFTER ADVANCING 3.
01174         SKIP1
01175      ADD +1  TO RECS-WRIT-NEW-2.
01176      ADD +1  TO LINE-CNTR-2.
01177      SKIP2
01178  170-HEADING-RTN.
01179      ADD +1 TO PAGE-CNTR.
01180      MOVE PAGE-CNTR TO HD1-PAGE.
01181      WRITE PRINT-REC FROM HEADING1 AFTER ADVANCING PAGE.
01182      WRITE PRINT-REC FROM HEADING2 AFTER ADVANCING 2.
01183      MOVE +0 TO LINE-CNTR.
01184      SKIP2
01185  180-HEADING-RTN-2.
01186      ADD +1 TO PAGE-CNTR-2.
01187      MOVE PAGE-CNTR-2 TO HD1-PAGE-2.
01188      WRITE PRT-ERR-REC FROM HEADING1-2 AFTER ADVANCING PAGE.
01189      WRITE PRT-ERR-REC FROM HEADING2-2 AFTER ADVANCING 2.
01190      MOVE +0 TO LINE-CNTR-2.
01191      SKIP2
01192  190-HEADING-RTN-3.
01193      ADD +1 TO PAGE-CNTR-3.
01194      MOVE PAGE-CNTR-3 TO HD1-PAGE-3.
01195      WRITE PRT-DTL-REC FROM HEADING1-3 AFTER ADVANCING PAGE.
01196      WRITE PRT-DTL-REC FROM HEADING2-3 AFTER ADVANCING 2.
01197      MOVE 'DIVISION NUMBER'  TO H3-MSG.
01198      MOVE 'PRIOR LAND VALUE' TO H3-1.
01199      MOVE 'PRIOR IMPV VALUE' TO H3-2.
01200      MOVE ' PRIOR TOT VALUE' TO H3-3.
01201      MOVE ' PRIOR PCL COUNT' TO H3-4.
01202      MOVE ' CURR LAND COUNT' TO H3-5.
01203      WRITE PRT-DTL-REC FROM BLANK-LINE AFTER ADVANCING 1.
01204      WRITE PRT-DTL-REC FROM HEADING3-3 AFTER ADVANCING 3.
01205      WRITE PRT-DTL-REC FROM BLANK-LINE AFTER ADVANCING 1.
01206      MOVE SPACES TO HEADING3-3.
01207      SKIP2
01208  200-INITIAL-VALUES.
01209      MOVE ZEROES TO FV-VAL (SUBT).
01210      SKIP2
01211  300-INITIAL-VALUES-DET.
01212      MOVE ZEROES TO D1-VAL-3 (SUBT).
01213      MOVE SPACES TO D1-FILLER (SUBT).
