00001  FD  NPHE-PRORATION-FILE
00002      BLOCK CONTAINS 0 RECORDS
00003      LABEL RECORDS STANDARD
00004      RECORD CONTAINS 65 CHARACTERS
00005      DATA RECORD IS NP-RECORD.
00006  COPY ASNPHEPRR1.
