00001  FD  AGENCY-ASMT-MASTER
00002      LABEL RECORDS ARE STANDARD
00003      BLOCK CONTAINS 0 RECORDS
00004      RECORD CONTAINS 275 CHARACTERS
00005      DATA RECORD IS AGCY-MSTR-REC.
00006  01  AGCY-MSTR-REC.
00007  COPY CLASRAGYR1.
