00001  FD  FRZVAL-SEL-FILE
00002      LABEL RECORDS ARE STANDARD
00003      BLOCK CONTAINS 0 RECORDS
00004      RECORD CONTAINS 100 CHARACTERS
00005      DATA RECORD FRZVAL-SEL-REC.
00006  01  FRZVAL-SEL-REC.
00007  COPY CLFRZSELR1.
