00001  FD  FRZVAL-TXCD-FILE
00002      LABEL RECORDS ARE STANDARD
00003      BLOCK CONTAINS 0 RECORDS
00004      RECORD CONTAINS 45 CHARACTERS
00005      DATA RECORD FRZVAL-TXCD-REC.
00006  01  FRZVAL-TXCD-REC.
00007  COPY CLFRZTAXR1.
