00001      05  EQ-FCTR.
00002          10  EQ-KEY.
00003              15  EQ-YEAR    PIC 99.
00004              15  EQ-QUAD    PIC 9.
00005          10  EQ-FACTOR      PIC 9V9(4).
00006          10  FILLER         PIC X(13).
