00001  FD  TXCDFILE
00002      LABEL RECORDS ARE STANDARD
00003      BLOCK CONTAINS 0 RECORDS
00004      RECORD CONTAINS 207 CHARACTERS
00005      DATA RECORD IS TXCD-REC.
00006  01  TXCD-REC.
00007  COPY TAXCODERD2.
