00001 *         -- A G E N C Y   E F T S
00002 *                 D E S C R I P T I O N   F I L E--
00003  FD  AGCY-EFTS-FLE
00004      BLOCK CONTAINS 0 RECORDS
00005      RECORD CONTAINS 256 CHARACTERS
00006      LABEL RECORDS ARE STANDARD
00007      DATA RECORD IS AGCY-EFTS-REC.
00008  01  AGCY-EFTS-REC.
00009  COPY TRAGEFTSR4.
